[
  {
    "title": "#382 Who Is Michael Ovitz?: The Rise and Fall (and Rise) of the Most Powerful Man in Hollywood",
    "description": "At the core of Michael Ovitz's success is his relentless work ethic and commitment to mastering his craft. 50 years ago he founded Creative Artists Agency. CAA starts out as just five young guys in a run down office and eventual...",
    "date": "MARCH 7TH, 2025",
    "duration": "01:31:25"
  },
  {
    "title": "#381 I Had Dinner With Michael Ovitz",
    "description": "What I learned from having an intense and fun 3 hour dinner with Michael Ovitz....",
    "date": "MARCH 7TH, 2025",
    "duration": "27:02"
  },
  {
    "title": "#380 Four Hundred Pages of Warren Buffett and Charlie Munger In Their Own Words",
    "description": "For over 30 years the Berkshire Hathaway Annual meetings were recorded. Munger and Buffett answered over 1700 questions from shareholders during that period. Alex Morris watched hundreds of hours of these meetings and then he ga...",
    "date": "FEBRUARY 25TH, 2025",
    "duration": "01:21:43"
  },
  {
    "title": "#379 Jerry Jones (Dallas Cowboys)",
    "description": "Jerry Jones rolled the dice until his knuckles bled. He started working at 7 years old. Jerry could sell, sell, sell. He sold fruit at his father’s grocery store in grade school and sold shoes out of the trunk of his car in coll...",
    "date": "FEBRUARY 18TH, 2025",
    "duration": "59:45"
  },
  {
    "title": "#378 The Last Oil Baron: Leon Hess",
    "description": "Your father goes bankrupt. You work for 50 cents a day to try to help your family survive the Great Depression. At 19 you see an opportunity where others see nothing. You start “a little fuel delivery business” with one used tru...",
    "date": "FEBRUARY 10TH, 2025",
    "duration": "53:24"
  },
  {
    "title": "#377 Expanding A Family Dynasty: Marcus Wallenberg Jr.",
    "description": "Marcus Wallenberg Jr's impact on Swedish industry was so substantial that during the 1970s, Wallenberg family businesses employed about 40% of Sweden's industrial workforce and represented 40% of the total worth of the Stockholm...",
    "date": "JANUARY 27TH, 2025",
    "duration": "01:03:42"
  },
  {
    "title": "#376 Jensen Huang: Founder of Nvidia",
    "description": "What I learned from reading The Nvidia Way: Jensen Huang and the Making of a Tech Giant by Tae Kim.",
    "date": "JANUARY 13TH, 2025",
    "duration": "01:40:44"
  },
  {
    "title": "#375 The Single Biggest Individual Financier In The World. The Richest Woman In America: Hetty Green",
    "description": "Hetty Green bailed out New York City. Her decisions on what interest rates to charge moved markets and were reported in major newspapers. She was a one woman bank and the single biggest individual financier in the world. She too...",
    "date": "JANUARY 6TH, 2025",
    "duration": "53:47"
  },
  {
    "title": "The Most Inspiring Autobiography I've Read: Chung Ju-yung Founder of Hyundai",
    "description": "Chung Ju-yung grew up so poor he had to eat tree bark to survive. He founded Hyundai and became the richest person in Korea. When Chung was in his 80s, he wrote an autobiography that tells the devastating reality of growing up i...",
    "date": "DECEMBER 27TH, 2024",
    "duration": "01:15:50"
  },
  {
    "title": "#374 Rare Jeff Bezos Interview",
    "description": "Jeff Bezos on retirement being lame, AI, the electricity metaphor for AI, the good fortune of being alive during multiple golden ages, long term life long passions, refusing to underestimate opportunity, dancing with curiosity,...",
    "date": "DECEMBER 15TH, 2024",
    "duration": "36:00"
  },
  {
    "title": "#373 Breakfast with Brad Jacobs + How To Make A Few Billion Dollars",
    "description": "Brad Jacobs is one of the most talented living entrepreneurs. Brad has started 8 different billion dollar or multi-billion dollar businesses. He has done over 500 acquisitions and has raised over $30 billion. He started his firs...",
    "date": "DECEMBER 6TH, 2024",
    "duration": "01:33:57"
  },
  {
    "title": "#372: Amancio Ortega: The Genius Behind the Inditex Group",
    "description": "Amancio Ortega is one of the wealthiest people in the world. Ortega is the founder of Inditex, a pioneer of fast fashion, an entrepreneur with over 60 years of experience, and has created a business model that is studied in univ...",
    "date": "NOVEMBER 30TH, 2024",
    "duration": "49:16"
  },
  {
    "title": "#371 James J. Hill: The Empire Builder",
    "description": "What I learned from rereading James J. Hill: Empire Builder by Michael P. Malone....",
    "date": "NOVEMBER 18TH, 2024",
    "duration": "58:43"
  },
  {
    "title": "#370 The Founder of IKEA: Ingvar Kamprad",
    "description": "What I learned from reading Leading By Design: The Ikea Story by Ingvar Kamprad and Bertil Torekull and The Testament of a Furniture Dealer by Ingvar Kamprad.",
    "date": "NOVEMBER 12TH, 2024",
    "duration": "01:05:33"
  },
  {
    "title": "#369 Elon Musk and The Early Days of SpaceX",
    "description": "What I learned from rereading Liftoff: Elon Musk and the Desperate Early Days That Launched SpaceX by Eric Berger....",
    "date": "NOVEMBER 2ND, 2024",
    "duration": "01:03:59"
  },
  {
    "title": "Steve Jobs and Edwin Land",
    "description": "What I learned from rereading Instant: The Story of Polaroid by Christopher Bonanos....",
    "date": "OCTOBER 20TH, 2024",
    "duration": "01:02:18"
  },
  {
    "title": "#368 Rockefeller's Autobiography",
    "description": "What I learned from rereading Random Reminiscences of Men and Events by John D. Rockefeller....",
    "date": "OCTOBER 15TH, 2024",
    "duration": "55:53"
  },
  {
    "title": "#367 Inside the Contrarian Mind of Sam Zell",
    "description": "What I learned from reading Money Talks, Bullsh*t Walks: Inside the Contrarian Mind of Billionaire Mogul Sam Zell by Ben Johnson....",
    "date": "OCTOBER 8TH, 2024",
    "duration": "50:06"
  },
  {
    "title": "#366 Mr. Beast Leaked Memo",
    "description": "What I learned from reading How To Succeed in Mr. Beast Production and how ideas from Sam Zell, Charlie Munger, Nick Sleep, Warren Buffett, Sam Zemurray, Bob Kierlin, Steve Jobs, Li Lu, Edwin Land, Larry Ellison, Bill Gates, Jef...",
    "date": "SEPTEMBER 27TH, 2024",
    "duration": "44:41"
  },
  {
    "title": "#365 Nick Sleep's Letters: The Full Collection of the Nomad Investment Partnership Letters to Partners",
    "description": "The best investors are not investors at all. They are entrepreneurs who have never sold. — Nick Sleep Nick Sleep’s letters are a masterclass on the importance of understanding the underlying reality of a business — what he cal...",
    "date": "SEPTEMBER 16TH, 2024",
    "duration": "55:48"
  },
  {
    "title": "#364 Nick & Zak's Excellent Adventure: How Nick Sleep and Qais Zaharia Built Their Investment Partnership",
    "description": "How Nick Sleep and Qais Zakaria built their radically unconventional investment partnership. From the incredible book Richer, Wiser, Happier: How The World's Greatest Investors Win In Markets and Life by William Green....",
    "date": "SEPTEMBER 10TH, 2024",
    "duration": "44:40"
  },
  {
    "title": "#363 Li Lu and Charlie Munger and Warren Buffett",
    "description": "I sent a friend this text: I'm working on another Li Lu episode but this one is about his remarkable investing career. Can be summarized by: 1. Studied Buffett and Munger. 2. Did that. Last episode was about how Li Lu survived o...",
    "date": "SEPTEMBER 6TH, 2024",
    "duration": "01:24:22"
  },
  {
    "title": "#362 Li Lu",
    "description": "Charlie Munger said that Li Lu was the only outsider he ever trusted with his money. Decades before Li Lu made Munger half a billion dollars, Li survived one of the most horrific childhoods imaginable: Born into poverty, aband...",
    "date": "AUGUST 26TH, 2024",
    "duration": "37:54"
  },
  {
    "title": "#361 Estée Lauder",
    "description": "Warren Buffett and Charlie Munger said it was a crime that more business schools didn't study Henry Singleton. I think it's a crime that more entrepreneurs don't study Estée Lauder. She is one of the best founders to ever do it....",
    "date": "AUGUST 18TH, 2024",
    "duration": "58:22"
  },
  {
    "title": "#360 Robert Kierlin: Founder of Fastenal",
    "description": "Since its founding in 1967 Fastenal has grown from a small fastener store in Winona, Minnesota, into a multibillion-dollar global organization. How did a small town “nuts and bolts” shop become one of the world's most dynamic gr...",
    "date": "AUGUST 13TH, 2024",
    "duration": "56:31"
  },
  {
    "title": "#359 The Russian Rockefellers: The Nobel Family Dynasty",
    "description": "The name of Nobel usually calls to mind Alfred Nobel, inventor of dynamite, and the internationally prestigious prizes that bear his name. But Alfred was only one member of a creative and innovative family who built an industria...",
    "date": "AUGUST 7TH, 2024",
    "duration": "01:06:11"
  },
  {
    "title": "#358 I had dinner with John Mackey, Founder of Whole Foods",
    "description": "What I learned from having dinner with John Mackey and reading his autobiography The Whole Story: Adventures in Love, Life, and Capitalism.",
    "date": "JULY 28TH, 2024",
    "duration": "01:34:20"
  },
  {
    "title": "#357 Haruki Murakami",
    "description": "What I learned from reading What I Talk About When I Talk About Running: A Memoir by Haruki Murakami....",
    "date": "JULY 21ST, 2024",
    "duration": "59:26"
  },
  {
    "title": "#356 How The Sun Rose On Silicon Valley: Bob Noyce (Founder of Intel)",
    "description": "What I learned from reading The Tinkerings of Robert Noyce: How the Sun Rose on Silicon Valley by Tom Wolfe....",
    "date": "JULY 12TH, 2024",
    "duration": "58:05"
  },
  {
    "title": "#355 Rare Bernard Arnault Interview",
    "description": "What I learned from reading The House of Arnault by Brad Stone and Angelina Rascouet....",
    "date": "JULY 4TH, 2024",
    "duration": "44:02"
  },
  {
    "title": "#354 Sam Walton: The Inside Story of America's Richest Man",
    "description": "What I learned from reading Sam Walton: The Inside Story of America's Richest Man by Vance Trimble....",
    "date": "JUNE 29TH, 2024",
    "duration": "01:32:50"
  },
  {
    "title": "#353 How To Be Rich by J. Paul Getty",
    "description": "What I learned from reading How To Be Rich by J. Paul Getty....",
    "date": "JUNE 23RD, 2024",
    "duration": "01:04:01"
  },
  {
    "title": "#352 J. Paul Getty: The Richest Private Citizen in America",
    "description": "What I learned from reading As I See it: The Autobiography of J. Paul Getty by J. Paul Getty....",
    "date": "JUNE 15TH, 2024",
    "duration": "01:29:55"
  },
  {
    "title": "#351 The Founder of Rolex: Hans Wilsdorf",
    "description": "What I learned from reading about Hans Wilsdorf and the founding of Rolex.",
    "date": "JUNE 4TH, 2024",
    "duration": "57:11"
  },
  {
    "title": "#350 How To Sell Like Steve Jobs",
    "description": "What I learned from reading The Presentation Secrets of Steve Jobs: How to Be Insanely Great in Front of Any Audience by Carmine Gallo...",
    "date": "MAY 27TH, 2024",
    "duration": "47:06"
  },
  {
    "title": "#349 How Steve Jobs Kept Things Simple",
    "description": "What I learned from reading Insanely Simple: The Obsession That Drives Apple's Success by Ken Segall....",
    "date": "MAY 20TH, 2024",
    "duration": "52:29"
  },
  {
    "title": "Michael Jordan In His Own Words",
    "description": "What I learned from reading Driven From Within by Michael Jordan and Mark Vancil....",
    "date": "MAY 12TH, 2024",
    "duration": "01:35:48"
  },
  {
    "title": "#348 The Financial Genius Behind A Century of Wall Street Scandals: Ivar Kreuger",
    "description": "What I learned from reading The Match King: Ivar Kreuger, The Financial Genius Behind a Century of Wall Street Scandals by Frank Partnoy....",
    "date": "MAY 7TH, 2024",
    "duration": "01:15:30"
  },
  {
    "title": "#347 How Walt Disney Built His Greatest Creation: Disneyland",
    "description": "What I learned from reading Disney's Land: Walt Disney and the Invention of the Amusement Park That Changed the World by Richard Snow....",
    "date": "APRIL 29TH, 2024",
    "duration": "01:17:54"
  },
  {
    "title": "#346 How Walt Disney Built Himself",
    "description": "What I learned from rereading Walt Disney: The Triumph of the American Imagination by Neal Gabler....",
    "date": "APRIL 22ND, 2024",
    "duration": "01:47:10"
  },
  {
    "title": "#345 George Lucas",
    "description": "What I learned from rereading George Lucas: A Life by Brian Jay Jones.",
    "date": "APRIL 12TH, 2024",
    "duration": "01:59:18"
  },
  {
    "title": "Steven Spielberg",
    "description": "What I learned from reading Steven Spielberg: A Biography by Joseph McBride....",
    "date": "APRIL 4TH, 2024",
    "duration": "01:38:54"
  },
  {
    "title": "#344 Quentin Tarantino",
    "description": "What I learned from reading Cinema Speculation by Quentin Tarantino....",
    "date": "MARCH 30TH, 2024",
    "duration": "01:06:18"
  },
  {
    "title": "#343 The Eternal Pursuit of Unhappiness: David Ogilvy",
    "description": "What I learned from reading Eternal Pursuit of Unhappiness Being Very Good Is No Good,You Have to Be Very, Very, Very, Very, Very Good by David Ogilvy and Ogivly & Mather....",
    "date": "MARCH 24TH, 2024",
    "duration": "32:00"
  },
  {
    "title": "#342 The Lessons of History (Will & Ariel Durant)",
    "description": "What I learned from reading The Lessons of History by Will and Ariel Durant....",
    "date": "MARCH 18TH, 2024",
    "duration": "53:15"
  },
  {
    "title": "#341 Cornelius Vanderbilt (Tycoon's War)",
    "description": "What I learned from rereading Tycoon's War: How Cornelius Vanderbilt Invaded a Country to Overthrow America's Most Famous Military Adventurer by Stephen Dando-Collins....",
    "date": "MARCH 11TH, 2024",
    "duration": "01:05:42"
  },
  {
    "title": "#340 Michael Jordan and Kobe Bryant",
    "description": "What I learned from reading Relentless: From Good to Great to Unstoppable by Tim Grover and Winning: The Unforgiving Race to Greatness by Tim Grover....",
    "date": "MARCH 1ST, 2024",
    "duration": "01:23:30"
  },
  {
    "title": "Jay Z's Autobiography",
    "description": "What I learned from reading Decoded by Jay Z....",
    "date": "FEBRUARY 25TH, 2024",
    "duration": "02:07:56"
  },
  {
    "title": "#339 Joseph Duveen: Robber Baron Art Dealer",
    "description": "What I learned from reading The Days of Duveen by S.N. Behrman....",
    "date": "FEBRUARY 20TH, 2024",
    "duration": "01:04:12"
  },
  {
    "title": "#338 Monty Moncrief Texas Oil Billionaire",
    "description": "What I learned from reading Wildcatters: A Story of Texans, Oil, and Money by Sally Helgesen.",
    "date": "FEBRUARY 13TH, 2024",
    "duration": "59:38"
  },
  {
    "title": "#337 Napoleon's Maxims and Strategy",
    "description": "What I learned from reading Roots of Strategy by Thomas R. Phillips and Napoleon and Modern War by Napoleon and Col. Lanza....",
    "date": "FEBRUARY 5TH, 2024",
    "duration": "01:00:31"
  },
  {
    "title": "#336 How To Lose A Few Billion Dollars: Samuel Insull",
    "description": "What I learned from reading Insull: The Rise and Fall of A Billionaire Utility Tycoon by Forrest McDonald....",
    "date": "FEBRUARY 1ST, 2024",
    "duration": "01:25:57"
  },
  {
    "title": "#335 How To Make A Few Billion Dollars: Brad Jacobs",
    "description": "What I learned from reading How To Make A Few Billion Dollars by Brad Jacobs....",
    "date": "JANUARY 23RD, 2024",
    "duration": "01:12:56"
  },
  {
    "title": "#334 Oprah",
    "description": "What I learned from reading the transcripts of Young Oprah on Her Life and Career and Oprah on Career, Life and Leadership....",
    "date": "JANUARY 16TH, 2024",
    "duration": "01:09:30"
  },
  {
    "title": "#333 Red Bull's Billionaire Maniac Founder: Dietrich Mateschitz",
    "description": "What I learned from reading The Red Bull Story by Wolfgang Fürweger.",
    "date": "JANUARY 8TH, 2024",
    "duration": "01:08:30"
  },
  {
    "title": "#332 Jesus",
    "description": "What I learned from reading Jesus: A Biography from a Believer by Paul Johnson....",
    "date": "DECEMBER 24TH, 2023",
    "duration": "34:42"
  },
  {
    "title": "#331 Christian Dior",
    "description": "What I learned from reading Dior by Dior: The Autobiography of Christian Dior and Creators by Paul Johnson....",
    "date": "DECEMBER 18TH, 2023",
    "duration": "01:00:33"
  },
  {
    "title": "#330 Les Schwab (Charlie Munger recommended this book)",
    "description": "What I learned from rereading Les Schwab Pride In Performance: Keep It Going! by Les Schwab....",
    "date": "DECEMBER 11TH, 2023",
    "duration": "01:37:07"
  },
  {
    "title": "#329 Charlie Munger (the NEW Poor Charlie's Almanack)",
    "description": "What I learned from reading the NEW Poor Charlie's Almanack: The Wit and Wisdom of Charlie Munger....",
    "date": "DECEMBER 5TH, 2023",
    "duration": "01:54:02"
  },
  {
    "title": "Reflections from my dinner with Charlie Munger",
    "description": "Reflections from my dinner with Charlie Munger.",
    "date": "NOVEMBER 29TH, 2023",
    "duration": "30:47"
  },
  {
    "title": "#328 Tom Murphy (Buffett's favorite manager)",
    "description": "What I learned from reading The Outsiders: Eight Unconventional CEOs and Their Radically Rational Blueprint for Success by William Thorndike....",
    "date": "NOVEMBER 22ND, 2023",
    "duration": "42:46"
  },
  {
    "title": "#327 Ted Turner",
    "description": "What I learned from reading Ted Turner's Autobiography....",
    "date": "NOVEMBER 14TH, 2023",
    "duration": "01:26:37"
  },
  {
    "title": "#326 Anna Wintour",
    "description": "What I learned from reading Anna: The Biography by Amy Odell....",
    "date": "NOVEMBER 6TH, 2023",
    "duration": "01:12:23"
  },
  {
    "title": "#325 Larry Gagosian (Billionaire Art Dealer)",
    "description": "What I learned from reading How Larry Gagosian Reshaped The Art World by Patrick Radden Keefe....",
    "date": "OCTOBER 30TH, 2023",
    "duration": "01:11:36"
  },
  {
    "title": "#324 John D. Rockefeller (38 Letters Rockefeller Wrote to His Son)",
    "description": "What I learned from reading The 38 Letters from J.D. Rockefeller to His Son by John D. Rockefeller....",
    "date": "OCTOBER 21ST, 2023",
    "duration": "01:46:26"
  },
  {
    "title": "Mike Bloomberg",
    "description": "What I learned from reading Bloomberg by Michael Bloomberg....",
    "date": "OCTOBER 11TH, 2023",
    "duration": "01:20:56"
  },
  {
    "title": "#323 Jimmy Buffett",
    "description": "What I learned from reading Jimmy Buffett: A Good Life All the Way by Ryan White and A Pirate Looks at Fifty by Jimmy Buffett.",
    "date": "OCTOBER 3RD, 2023",
    "duration": "01:05:32"
  },
  {
    "title": "#322 Herb Kelleher (Southwest Airlines)",
    "description": "What I learned from reading Nuts!: Southwest Airlines' Crazy Recipe for Business and Personal Success by Kevin and Jackie Freiberg and Herb’s Heroes by David Sanders....",
    "date": "SEPTEMBER 26TH, 2023",
    "duration": "43:02"
  },
  {
    "title": "#321 Working with Jeff Bezos",
    "description": "What I learned from reading Working Backwards: Insights, Stories, and Secrets from Inside Amazon by Colin Bryar and Bill Carr.",
    "date": "SEPTEMBER 21ST, 2023",
    "duration": "57:25"
  },
  {
    "title": "#320 The Making of Winston Churchill Part 2",
    "description": "What I learned from reading Young Titan: The Making of Winston Churchill by Michael Shelden....",
    "date": "SEPTEMBER 15TH, 2023",
    "duration": "54:30"
  },
  {
    "title": "Sam Zemurray (The Fish That Ate the Whale)",
    "description": "What I learned from rereading The Fish That Ate the Whale: The Life and Times of America's Banana King by Rich Cohen.",
    "date": "SEPTEMBER 12TH, 2023",
    "duration": "01:29:58"
  },
  {
    "title": "#319 The Making of Winston Churchill Part 1",
    "description": "What I learned from reading Hero of the Empire: The Boer War, a Daring Escape, and the Making of Winston Churchill by Candice Millard....",
    "date": "SEPTEMBER 5TH, 2023",
    "duration": "48:11"
  },
  {
    "title": "The best interview I've ever done about Founders",
    "description": "What I learned from the first 6 years of making Founders....",
    "date": "SEPTEMBER 3RD, 2023",
    "duration": "01:21:05"
  },
  {
    "title": "#318 Alistair Urquhart (Listen to this when you’re stressed)",
    "description": "What I learned from reading The Forgotten Highlander: An Incredible WWII Story of Survival in the Pacific by Alistair Urquhart.",
    "date": "AUGUST 28TH, 2023",
    "duration": "47:45"
  },
  {
    "title": "#317 Ed Catmull (Founder of Pixar)",
    "description": "What I learned from rereading Creativity, Inc.: Overcoming the Unseen Forces That Stand in the Way of True Inspiration by Ed Catmull.",
    "date": "AUGUST 21ST, 2023",
    "duration": "01:05:10"
  },
  {
    "title": "#316 Bugatti",
    "description": "What I learned from reading The Bugatti Story by L’Ebe Bugatti.",
    "date": "AUGUST 14TH, 2023",
    "duration": "58:28"
  },
  {
    "title": "#315 Balenciaga",
    "description": "What I learned from reading Creators: From Chaucer and Durer to Picasso and Disney by Paul Johnson....",
    "date": "AUGUST 7TH, 2023",
    "duration": "36:10"
  },
  {
    "title": "#314 Paul Graham (How To Do Great Work)",
    "description": "What I learned from reading How To Do Great Work by Paul Graham.",
    "date": "JULY 31ST, 2023",
    "duration": "57:38"
  },
  {
    "title": "#313 Christopher Nolan",
    "description": "What I learned from reading The Nolan Variations: The Movies, Mysteries, and Marvels of Christopher Nolan by Tom Shone.",
    "date": "JULY 25TH, 2023",
    "duration": "48:37"
  },
  {
    "title": "#312 Mark Twain",
    "description": "What I learned from reading Lighting Out for the Territory: How Samuel Clemens Headed West and Became Mark Twain by Roy Morris Jr.",
    "date": "JULY 19TH, 2023",
    "duration": "55:27"
  },
  {
    "title": "#311 James Cameron",
    "description": "What I learned from reading The Futurist: The Life and Films of James Cameron by Rebecca Keegan and The Return of James Cameron, Box Office King by Zach Baron.",
    "date": "JULY 12TH, 2023",
    "duration": "01:11:45"
  },
  {
    "title": "#310 Walt Disney and Picasso",
    "description": "What I learned from reading Creators: From Chaucer and Durer to Picasso and Disney by Paul Johnson....",
    "date": "JULY 4TH, 2023",
    "duration": "51:58"
  },
  {
    "title": "Michael Jordan (The Life)",
    "description": "What I learned from reading Michael Jordan: The Life by Roland Lazenby.",
    "date": "JUNE 30TH, 2023",
    "duration": "01:39:00"
  },
  {
    "title": "#309 Arnold Schwarzenegger (Before He Was Successful)",
    "description": "What I learned from reading Arnold and Me: In the Shadow of the Austrian Oak by Barbara Outland Baker....",
    "date": "JUNE 26TH, 2023",
    "duration": "39:41"
  },
  {
    "title": "#308 The Founder of Glock",
    "description": "What I learned from reading Glock: The Rise of America's Gun by Paul Barrett....",
    "date": "JUNE 19TH, 2023",
    "duration": "40:07"
  },
  {
    "title": "#307: The World's Great Family Dynasties: Rockefeller, Rothschild, Morgan, & Toyada",
    "description": "What I learned from reading Dynasties: Fortunes and Misfortunes of the World's Great Family Businesses by David Landes.",
    "date": "JUNE 12TH, 2023",
    "duration": "01:02:49"
  },
  {
    "title": "#306 David Ogilvy (Confessions of an Advertising Man)",
    "description": "What I learned from reading Confessions of an Advertising Man by David Ogilvy....",
    "date": "JUNE 5TH, 2023",
    "duration": "48:13"
  },
  {
    "title": "#305 Robert Caro on power, poverty, ruthlessness, & obsession",
    "description": "What I learned from reading Working by Robert Caro....",
    "date": "MAY 29TH, 2023",
    "duration": "54:33"
  },
  {
    "title": "#304: Sol Price (The Founder Who Taught Jim Sinegal, Sam Walton, Jeff Bezos, Bernie Marcus)",
    "description": "What I learned from reading Sol Price: Retail Revolutionary by Robert Price....",
    "date": "MAY 22ND, 2023",
    "duration": "59:48"
  },
  {
    "title": "#303 Rose Blumkin (Warren Buffett's Favorite Founder)",
    "description": "What I learned from reading The Women of Berkshire Hathaway: Lessons from Warren Buffett's Female CEOs and Directors by Karen Linder....",
    "date": "MAY 15TH, 2023",
    "duration": "32:53"
  },
  {
    "title": "#302 Napoleon (The Mind of Napoleon)",
    "description": "What I learned from reading The Mind of Napoleon: A Selection of His Written and Spoken Words edited by J. Christopher Herold....",
    "date": "MAY 8TH, 2023",
    "duration": "50:08"
  },
  {
    "title": "#301 Tiger Woods",
    "description": "What I learned from reading Tiger Woods by Jeff Benedict and Armen Keteyian.",
    "date": "MAY 1ST, 2023",
    "duration": "01:03:33"
  },
  {
    "title": "#300 James Dyson (Against the Odds)",
    "description": "What I learned from reading Against the Odd: An Autobiography by James Dyson for the 4th time....",
    "date": "APRIL 24TH, 2023",
    "duration": "01:21:24"
  },
  {
    "title": "#299 Steve Jobs (Make Something Wonderful)",
    "description": "What I learned from reading Make Something Wonderful: Steve Jobs in his own words.",
    "date": "APRIL 17TH, 2023",
    "duration": "02:00:45"
  },
  {
    "title": "#298 I had lunch with Sam Zell",
    "description": "What I learned from having lunch with Sam Zell and reading Zeckendorf: The Autobiography of The man Who Played a Real-Life Game of Monopoly and Won the Largest Real Estate Empire in History by William Zeckendorf....",
    "date": "APRIL 10TH, 2023",
    "duration": "01:30:04"
  },
  {
    "title": "#297 Yvon Chouinard (Patagonia)",
    "description": "What I learned from rereading Let My People Go Surfing: The Education of a Reluctant Businessman by Yvon Chouinard.",
    "date": "APRIL 3RD, 2023",
    "duration": "59:56"
  },
  {
    "title": "A conversation with David and Ben from the Acquired podcast",
    "description": "David Rosenthal and Ben Gilbert — of the Acquired podcast — invited me to San Francisco for a discussion on our mutual obsession: spending every waking hour studying the history of entrepreneurship and sharing those lessons on o...",
    "date": "MARCH 29TH, 2023",
    "duration": "03:09:50"
  },
  {
    "title": "#296 Bernard Arnault (The Richest Man in the World)",
    "description": "What I learned from reading The Taste of Luxury: Bernard Arnault and the Moet-Hennessy Louis Vuitton Story by Nadege Forestier and Nazanine Ravai.",
    "date": "MARCH 27TH, 2023",
    "duration": "01:07:50"
  },
  {
    "title": "#295 I had dinner with Charlie Munger",
    "description": "What I learned from rereading The Tao of Charlie Munger.",
    "date": "MARCH 21ST, 2023",
    "duration": "01:17:30"
  },
  {
    "title": "#294 Napoleon",
    "description": "What I learned from reading Napoleon: A Concise Biography by David Bell.",
    "date": "MARCH 13TH, 2023",
    "duration": "43:29"
  },
  {
    "title": "#293: Ray Kroc (The Making of McDonald's)",
    "description": "What I learned from rereading Grinding It Out: The Making of McDonald's by Ray Kroc.",
    "date": "MARCH 7TH, 2023",
    "duration": "52:14"
  },
  {
    "title": "#292 Daniel Ludwig (The Invisible Billionaire)",
    "description": "What I learned from rereading The Invisible Billionaire: Daniel Ludwig by Jerry Shields....",
    "date": "FEBRUARY 27TH, 2023",
    "duration": "46:41"
  },
  {
    "title": "#291 David Packard (Founder of HP)",
    "description": "What I learned from reading The HP Way: How Bill Hewlett and I Built Our Company by David Packard.",
    "date": "FEBRUARY 20TH, 2023",
    "duration": "47:03"
  },
  {
    "title": "#290 Bill Gates",
    "description": "What I learned from rereading Hard Drive: Bill Gates and the Making of the Microsoft Empire by James Wallace and Jim Erickson.",
    "date": "FEBRUARY 13TH, 2023",
    "duration": "47:20"
  },
  {
    "title": "#289 Brunello Cucinelli",
    "description": "What I learned from reading The Dream of Solomeo: My Life and the Idea of Humanistic Capitalism by Brunello Cucinelli.",
    "date": "FEBRUARY 7TH, 2023",
    "duration": "53:17"
  },
  {
    "title": "#288 Ralph Lauren",
    "description": "What I learned from reading Ralph Lauren: The Man Behind the Mystique by Jeffrey Trachtenberg.",
    "date": "JANUARY 31ST, 2023",
    "duration": "01:01:17"
  },
  {
    "title": "#287 The Founder of Rolls-Royce",
    "description": "What I learned from rereading Rolls-Royce: The Magic of a Name: The First Forty Years of Britain s Most Prestigious Company by Peter Pugh.",
    "date": "JANUARY 23RD, 2023",
    "duration": "31:53"
  },
  {
    "title": "#286 Warren Buffett and Charlie Munger",
    "description": "What I learned from reading All I Want To Know Is Where I'm Going To Die So I'll Never Go There: Buffett & Munger – A Study in Simplicity and Uncommon, Common Sense by Peter Bevelin....",
    "date": "JANUARY 16TH, 2023",
    "duration": "01:10:44"
  },
  {
    "title": "#285 Jay Gould (How Jay Gould Built Wall Street's Biggest Fortune)",
    "description": "What I learned from reading American Rascal: How Jay Gould Built Wall Street's Biggest Fortune by Greg Steinmetz.",
    "date": "JANUARY 10TH, 2023",
    "duration": "59:31"
  },
  {
    "title": "#284 Andrew Carnegie and Henry Clay Frick",
    "description": "What I learned from rereading Meet You in Hell: Andrew Carnegie, Henry Clay Frick, and the Bitter Partnership That Changed America by Les Standiford.",
    "date": "JANUARY 2ND, 2023",
    "duration": "01:07:17"
  },
  {
    "title": "#283 Andrew Carnegie",
    "description": "What I learned from rereading The Autobiography of Andrew Carnegie by Andrew Carnegie....",
    "date": "DECEMBER 26TH, 2022",
    "duration": "52:02"
  },
  {
    "title": "#282 Jeff Bezos Shareholder Letters",
    "description": "What I learned from rereading Jeff Bezos' Shareholder Letters (for the 3rd time!)...",
    "date": "DECEMBER 19TH, 2022",
    "duration": "01:10:28"
  },
  {
    "title": "#281 Working with Steve Jobs",
    "description": "What I learned from rereading Creative Selection: Inside Apple's Design Process During the Golden Age of Steve Jobs by Ken Kocienda.",
    "date": "DECEMBER 13TH, 2022",
    "duration": "41:09"
  },
  {
    "title": "The Founder of Kinkos — Paul Orfalea",
    "description": "What I learned from reading Copy This!: How I turned Dyslexia, ADHD, and 100 square feet into a company called Kinkos by Paul Orfalea.",
    "date": "DECEMBER 9TH, 2022",
    "duration": "01:14:33"
  },
  {
    "title": "#280 Jimi Hendrix",
    "description": "What I learned from reading Starting At Zero: His Own Story by Jimi Hendrix.",
    "date": "DECEMBER 6TH, 2022",
    "duration": "54:47"
  },
  {
    "title": "#279 What I Learned Before I Sold to Warren Buffett",
    "description": "What I learned from reading What I Learned Before I Sold to Warren Buffett: An Entrepreneur's Guide to Developing a Highly Successful Company by Barnett Helzberg Jr.",
    "date": "NOVEMBER 29TH, 2022",
    "duration": "56:25"
  },
  {
    "title": "#278 Peter Thiel",
    "description": "What I learned from rereading Zero to One: Notes on Startups, or How to Build the Future by Peter Thiel.",
    "date": "NOVEMBER 22ND, 2022",
    "duration": "56:33"
  },
  {
    "title": "#277 Paul Graham's Essays Part 3",
    "description": "What I learned from reading Hackers and Painters: Big Ideas From The Computer Age by Paul Graham...",
    "date": "NOVEMBER 17TH, 2022",
    "duration": "47:33"
  },
  {
    "title": "#276 Paul Graham’s Essays Part 2",
    "description": "What I learned from reading Paul Graham’s essays.",
    "date": "NOVEMBER 9TH, 2022",
    "duration": "42:02"
  },
  {
    "title": "#275 Paul Graham",
    "description": "What I learned from reading Paul Graham’s essays.",
    "date": "NOVEMBER 3RD, 2022",
    "duration": "01:19:49"
  },
  {
    "title": "#274 Jim Clark (Silicon Graphics, Netscape)",
    "description": "What I learned from rereading The New New Thing: A Silicon Valley Story by Michael Lewis.",
    "date": "OCTOBER 28TH, 2022",
    "duration": "53:08"
  },
  {
    "title": "#273 Kobe Bryant (Mamba Mentality)",
    "description": "What I learned from rereading The Mamba Mentality: How I Play by Kobe Bryant....",
    "date": "OCTOBER 26TH, 2022",
    "duration": "31:05"
  },
  {
    "title": "#272 Kobe Bryant (The Life)",
    "description": "What I learned from reading Showboat: The Life of Kobe Bryant by Roland Lazenby....",
    "date": "OCTOBER 19TH, 2022",
    "duration": "55:52"
  },
  {
    "title": "#271 Vannevar Bush (Engineer of the American Century)",
    "description": "What I learned from reading Endless Frontier: Vannevar Bush, Engineer of the American Century by G. Pascal Zachary.",
    "date": "OCTOBER 13TH, 2022",
    "duration": "53:24"
  },
  {
    "title": "#270: Vannevar Bush (Pieces of the Action)",
    "description": "What I learned from reading Pieces of the Action by Vannevar Bush.",
    "date": "OCTOBER 6TH, 2022",
    "duration": "01:05:15"
  },
  {
    "title": "#269 Sam Zell",
    "description": "What I learned from reading Am I Being Too Subtle?: Straight Talk From a Business Rebel by Sam Zell.",
    "date": "SEPTEMBER 29TH, 2022",
    "duration": "01:08:09"
  },
  {
    "title": "#268 John Malone (Cable Cowboy)",
    "description": "What I learned from reading Cable Cowboy: John Malone and the Rise of the Modern Cable Business by Mark Robichaux.",
    "date": "SEPTEMBER 22ND, 2022",
    "duration": "01:01:16"
  },
  {
    "title": "#267 Thomas Edison",
    "description": "What I learned from reading Edison: A Biography by Matthew Josephson.",
    "date": "SEPTEMBER 15TH, 2022",
    "duration": "01:10:27"
  },
  {
    "title": "#266 Henry Ford's Autobiography",
    "description": "What I learned from rereading My Life and Work by Henry Ford.",
    "date": "SEPTEMBER 8TH, 2022",
    "duration": "01:13:45"
  },
  {
    "title": "#265 Becoming Steve Jobs: The Evolution of a Reckless Upstart into a Visionary Leader",
    "description": "What I learned from rereading Becoming Steve Jobs: The Evolution of a Reckless Upstart into a Visionary Leader by Brent Schlender and Rick Tetzeli.",
    "date": "AUGUST 30TH, 2022",
    "duration": "01:26:10"
  },
  {
    "title": "#264 The Story of Edwin Land and Polaroid",
    "description": "What I learned from rereading Instant: The Story of Polaroid by Christopher Bonanos....",
    "date": "AUGUST 24TH, 2022",
    "duration": "54:05"
  },
  {
    "title": "#263 Land's Polaroid: A Company and the Man Who Invented It",
    "description": "What I learned from rereading Land's Polaroid: A Company and the Man Who Invented It by Peter C. Wensberg.",
    "date": "AUGUST 18TH, 2022",
    "duration": "01:11:31"
  },
  {
    "title": "#262 Herbie Cohen (World's Greatest Negotiator)",
    "description": "What I learned from reading The Adventures of Herbie Cohen: World's Greatest Negotiator by Rich Cohen....",
    "date": "AUGUST 12TH, 2022",
    "duration": "59:14"
  },
  {
    "title": "#261 Dee Hock's Autobiography of a Restless Mind Volume One and Two",
    "description": "What I learned from rereading Autobiography of a Restless Mind: Reflections on the Human Condition Volume 1 and Autobiography of a Restless Mind: Reflections on the Human Condition Volume 2 by Dee Hock.",
    "date": "AUGUST 4TH, 2022",
    "duration": "39:05"
  },
  {
    "title": "#260 One from Many: VISA and the Rise of Chaordic Organization",
    "description": "What I learned from rereading One from Many: VISA and the Rise of Chaordic Organization by Dee Hock....",
    "date": "AUGUST 3RD, 2022",
    "duration": "01:21:22"
  },
  {
    "title": "#259 Bob Dylan",
    "description": "What I learned from reading Chronicles: Volume One by Bob Dylan.",
    "date": "JULY 27TH, 2022",
    "duration": "01:18:24"
  },
  {
    "title": "#258: Jay Gould (Dark Genius of Wall Street)",
    "description": "What I learned from reading Dark Genius of Wall Street: The Misunderstood Life of Jay Gould, King of the Robber Barons by Edward J. Renehan Jr.",
    "date": "JULY 22ND, 2022",
    "duration": "01:39:15"
  },
  {
    "title": "#257 Richard Garriott (Video Games and Space Exploration)",
    "description": "What I learned from reading Explore/Create My Life in Pursuit of New Frontiers, Hidden Worlds, and the Creative Spark by Richard Garriott.",
    "date": "JULY 15TH, 2022",
    "duration": "01:18:23"
  },
  {
    "title": "#256 Edward L. Bernays (Public Relations, Advertising, & Persuasion)",
    "description": "What I learned from reading The Father of Spin: Edward L. Bernays and the Birth of Public Relations by Larry Tye.",
    "date": "JULY 9TH, 2022",
    "duration": "01:18:14"
  },
  {
    "title": "#255 Sam Zemurray (Banana King)",
    "description": "What I learned from rereading The Fish That Ate the Whale: The Life and Times of America's Banana King by Rich Cohen.",
    "date": "JULY 2ND, 2022",
    "duration": "01:29:58"
  },
  {
    "title": "#254 John D. Rockefeller: The Founding Father of the Rockefellers",
    "description": "What I learned from reading John D: The Founding Father of the Rockefellers by David Freeman Hawke.",
    "date": "JUNE 27TH, 2022",
    "duration": "01:40:48"
  },
  {
    "title": "#253 Henry Goldman (Goldman Sachs)",
    "description": "What I learned from reading When Money Was In Fashion: Henry Goldman, Goldman Sachs, and the Founding of Wall Street by June Breton Fisher....",
    "date": "JUNE 22ND, 2022",
    "duration": "56:11"
  },
  {
    "title": "#252 Socrates",
    "description": "What I learned from reading Socrates: A Man for Our Times by Paul Johnson.",
    "date": "JUNE 17TH, 2022",
    "duration": "47:28"
  },
  {
    "title": "#251 Ben Franklin and George Washington: The Founding Partnership",
    "description": "What I learned from reading Franklin & Washington: The Founding Partnership by Edward Larson.",
    "date": "JUNE 13TH, 2022",
    "duration": "57:14"
  },
  {
    "title": "#250 Jacob Fugger (The Richest Man Who Ever Lived)",
    "description": "What I learned from reading The Richest Man Who Ever Lived: The Life and Times of Jacob Fugger by Greg Steinmetz.",
    "date": "JUNE 8TH, 2022",
    "duration": "57:04"
  },
  {
    "title": "Steve Jobs's Heroes",
    "description": "Steve Jobs and His Heroes....",
    "date": "JUNE 2ND, 2022",
    "duration": "30:51"
  },
  {
    "title": "#249 Steve Jobs In His Own Words",
    "description": "What I learned from reading I, Steve: Steve Jobs In His Own Words by George Beahm.",
    "date": "JUNE 1ST, 2022",
    "duration": "49:34"
  },
  {
    "title": "#248 John D. Rockefeller (Titan)",
    "description": "What I learned from reading Titan: The Life of John D. Rockefeller by Ron Chernow....",
    "date": "MAY 28TH, 2022",
    "duration": "01:50:37"
  },
  {
    "title": "#247 Henry Flagler (Rockefeller's partner)",
    "description": "What I learned from reading Last Train to Paradise: Henry Flagler and the Spectacular Rise and Fall of the Railroad that Crossed an Ocean by Les Standiford.",
    "date": "MAY 19TH, 2022",
    "duration": "01:16:19"
  },
  {
    "title": "#246 Mark Leonard's Shareholder Letters",
    "description": "What I learned from reading Constellation Software Inc. President's Letters by Mark Leonard.",
    "date": "MAY 13TH, 2022",
    "duration": "55:53"
  },
  {
    "title": "#245 Rick Rubin (In the Studio)",
    "description": "What I learned from reading Rick Rubin: In the Studio by Jake Brown.",
    "date": "MAY 8TH, 2022",
    "duration": "01:21:24"
  },
  {
    "title": "#244 Harry Snyder (In-N-Out Burger)",
    "description": "What I learned from reading In-N-Out Burger: A Behind-the-Counter Look at the Fast-Food Chain That Breaks All the Rules by Stacy Perman.",
    "date": "MAY 3RD, 2022",
    "duration": "01:05:04"
  },
  {
    "title": "#243 Francis Greenburger (Real Estate Billionaire)",
    "description": "What I learned from reading Risk Game: Self Portrait of an Entrepreneur by Francis Greenburger.",
    "date": "APRIL 26TH, 2022",
    "duration": "01:16:25"
  },
  {
    "title": "#242 Francis Ford Coppola: A Filmmaker's Life",
    "description": "What I learned from reading Francis Ford Coppola: A Filmmaker's Life by Michael Schumacher.",
    "date": "APRIL 21ST, 2022",
    "duration": "01:29:13"
  },
  {
    "title": "#241 The Wright Brothers, Glenn Curtiss, and the Battle to Control the Skies",
    "description": "What I learned from reading Birdmen: The Wright Brothers, Glenn Curtiss, and the Battle to Control the Skies by Lawrence Goldstone.",
    "date": "APRIL 14TH, 2022",
    "duration": "01:27:13"
  },
  {
    "title": "#240 Mozart: A Life",
    "description": "What I learned from reading Mozart: A Life by Paul Johnson.",
    "date": "APRIL 7TH, 2022",
    "duration": "45:53"
  },
  {
    "title": "Steve Jobs and His Heroes",
    "description": "Steve Jobs and His Heroes....",
    "date": "APRIL 2ND, 2022",
    "duration": "30:24"
  },
  {
    "title": "#239 The Wright Brothers",
    "description": "What I learned from rereading The Wright Brothers by David McCullough.",
    "date": "MARCH 29TH, 2022",
    "duration": "01:33:18"
  },
  {
    "title": "#238 Jay Z: Decoded",
    "description": "What I learned from reading Decoded by Jay Z....",
    "date": "MARCH 24TH, 2022",
    "duration": "01:58:14"
  },
  {
    "title": "#237 Julio Lobo (Cuba's Last Sugar Tycoon)",
    "description": "What I learned from reading The Sugar King of Havana: The Rise and Fall of Julio Lobo, Cuba's Last Tycoon by John Paul Rathbone....",
    "date": "MARCH 16TH, 2022",
    "duration": "01:10:35"
  },
  {
    "title": "#236 Nims Purja (Mountain Climber)",
    "description": "What I learned from reading Beyond Possible: One Man, Fourteen Peaks, and the Mountaineering Achievement of a Lifetime by Nims Purja.",
    "date": "MARCH 12TH, 2022",
    "duration": "01:04:27"
  },
  {
    "title": "#235 Steve Jobs (The Pixar Story)",
    "description": "What I learned from reading To Pixar And Beyond: My Unlikely Journey with Steve Jobs to Make Entertainment History by Lawrence Levy.",
    "date": "MARCH 7TH, 2022",
    "duration": "01:18:25"
  },
  {
    "title": "#234 Sam Walton: Made In America",
    "description": "What I learned from rereading Sam Walton: Made In America by Sam Walton.",
    "date": "FEBRUARY 28TH, 2022",
    "duration": "01:55:24"
  },
  {
    "title": "#233 Elon Musk, Peter Thiel, Max Levchin (PayPal)",
    "description": "What I learned from reading The Founders: The Story of Paypal and the Entrepreneurs Who Shaped Silicon Valley by Jimmy Soni.",
    "date": "FEBRUARY 23RD, 2022",
    "duration": "01:53:50"
  },
  {
    "title": "#232 Alexander the Great",
    "description": "What I learned from reading Alexander the Great: The Brief Life and Towering Exploits of History's Greatest Conqueror--As Told By His Original Biographers by Arrian, Plutarch, and Quintus Curtius Rufus....",
    "date": "FEBRUARY 17TH, 2022",
    "duration": "01:02:32"
  },
  {
    "title": "#231 William Rosenberg (Founder of Dunkin Donuts)",
    "description": "What I learned from reading Time to Make the Donuts: The Founder of Dunkin Donuts Shares an American Journey by William Rosenberg.",
    "date": "FEBRUARY 12TH, 2022",
    "duration": "01:18:53"
  },
  {
    "title": "#230 Lucille Ball (TV's biggest star)",
    "description": "What I learned from reading Love, Lucy by Lucille Ball....",
    "date": "FEBRUARY 7TH, 2022",
    "duration": "01:03:04"
  },
  {
    "title": "#229 Sidney Harman (Founder of Harman Kardon)",
    "description": "What I learned from reading Mind Your Own Business: A Maverick's Guide to Business, Leadership and Life by Sidney Harman",
    "date": "JANUARY 30TH, 2022",
    "duration": "01:34:24"
  },
  {
    "title": "#228 Michael Bloomberg",
    "description": "What I learned from reading Bloomberg by Michael Bloomberg....",
    "date": "JANUARY 27TH, 2022",
    "duration": "01:20:56"
  },
  {
    "title": "I read 66 biographies last year— Here are my top 10!",
    "description": "A list of 10 episodes to start with....",
    "date": "JANUARY 24TH, 2022",
    "duration": "12:02"
  },
  {
    "title": "#227 The Essays of Warren Buffett",
    "description": "What I learned from reading The Essays of Warren Buffett by Warren Buffett and Lawrence Cunningham.",
    "date": "JANUARY 20TH, 2022",
    "duration": "01:56:51"
  },
  {
    "title": "#226 Heroes: From Alexander the Great and Julius Caesar to Churchill and de Gaulle",
    "description": "What I learned from reading Heroes: From Alexander the Great and Julius Caesar to Churchill and de Gaulle by Paul Johnson....",
    "date": "JANUARY 12TH, 2022",
    "duration": "01:06:58"
  },
  {
    "title": "#225 Winston Churchill",
    "description": "What I learned from reading Churchill by Paul Johnson....",
    "date": "JANUARY 9TH, 2022",
    "duration": "01:22:47"
  },
  {
    "title": "#224 Charles de Gaulle",
    "description": "What I learned from reading Charles de Gaulle by Julian Jackson....",
    "date": "JANUARY 6TH, 2022",
    "duration": "01:49:50"
  },
  {
    "title": "#223 Unstoppable: Siggi Wilzig's Astonishing Journey from Auschwitz Survivor and Penniless Immigrant to Wall Street Legend",
    "description": "What I learned from reading Unstoppable: Siggi Wilzig's Astonishing Journey from Auschwitz Survivor and Penniless Immigrant to Wall Street Legend by Joshua M. Greene.",
    "date": "DECEMBER 29TH, 2021",
    "duration": "01:15:00"
  },
  {
    "title": "#222 Ed Thorp (My personal blueprint)",
    "description": "What I learned from rereading A Man for All Markets: From Las Vegas to Wall Street, How I Beat the Dealer and the Market by Ed Thorp....",
    "date": "DECEMBER 20TH, 2021",
    "duration": "01:38:18"
  },
  {
    "title": "#221 Charlie Munger",
    "description": "What I learned from reading Damn Right: Behind the Scenes with Berkshire Hathaway Billionaire Charlie Munger by Janet Lowe.",
    "date": "DECEMBER 13TH, 2021",
    "duration": "01:24:45"
  },
  {
    "title": "#220 Enzo Ferrari: The Man and the Machine",
    "description": "What I learned from reading Enzo Ferrari: The Man and the Machine by Brock Yates.",
    "date": "DECEMBER 9TH, 2021",
    "duration": "01:22:07"
  },
  {
    "title": "#219 Tony Bourdain: The Definitive Biography",
    "description": "What I learned from reading Bourdain: The Definitive Oral Biography by Laurie Woolever.",
    "date": "NOVEMBER 30TH, 2021",
    "duration": "01:46:57"
  },
  {
    "title": "#218 Johan Cruyff (A Life of Total Football)",
    "description": "What I learned from reading My Turn: A Life of Total Football by Johan Cruyff.",
    "date": "NOVEMBER 25TH, 2021",
    "duration": "58:17"
  },
  {
    "title": "#217 Estée Lauder",
    "description": "What I learned from rereading Estée Lauder: A Success Story by Estée Lauder....",
    "date": "NOVEMBER 18TH, 2021",
    "duration": "01:22:56"
  },
  {
    "title": "#216 Paul Van Doren (Founder of Vans)",
    "description": "What I learned from reading Authentic: A Memoir by the Founder of Vans by Paul Van Doren....",
    "date": "NOVEMBER 14TH, 2021",
    "duration": "01:29:03"
  },
  {
    "title": "#215: J. Robert Oppenheimer and Leslie Groves (The General and the Genius)",
    "description": "What I learned from reading The General and the Genius: Groves and Oppenheimer—The Unlikely Partnership that Built the Atom Bomb by James Kunetka.",
    "date": "NOVEMBER 9TH, 2021",
    "duration": "57:25"
  },
  {
    "title": "#214 Steve Jobs: The Exclusive Biography",
    "description": "What I learned from rereading Steve Jobs: The Exclusive Biography by Walter Isaacson....",
    "date": "NOVEMBER 3RD, 2021",
    "duration": "02:12:16"
  },
  {
    "title": "#213 Michael Jordan: Driven From Within",
    "description": "What I learned from reading Driven From Within by Michael Jordan and Mark Vancil....",
    "date": "OCTOBER 27TH, 2021",
    "duration": "01:07:22"
  },
  {
    "title": "#212 Michael Jordan: The Life",
    "description": "What I learned from reading Michael Jordan: The Life by Roland Lazenby.",
    "date": "OCTOBER 23RD, 2021",
    "duration": "01:37:46"
  },
  {
    "title": "#211 Aristotle Onassis: An Extravagant Life",
    "description": "What I learned from reading Onassis: An Extravagant Life by Frank Brady....",
    "date": "OCTOBER 16TH, 2021",
    "duration": "01:15:16"
  },
  {
    "title": "#210 Stephen King On Writing: A Memoir of the Craft",
    "description": "What I learned from reading Stephen King On Writing: A Memoir of the Craft by Stephen King....",
    "date": "OCTOBER 11TH, 2021",
    "duration": "01:09:50"
  },
  {
    "title": "#209 Steven Spielberg: A Biography",
    "description": "What I learned from reading Steven Spielberg: A Biography by Joseph McBride....",
    "date": "OCTOBER 7TH, 2021",
    "duration": "01:10:46"
  },
  {
    "title": "#208 Steve Jobs, Bill Gates, Michael Dell, Bill Gates, Andy Grove, Bill Hewlett",
    "description": "What I learned from reading In the Company of Giants: Candid Conversations With the Visionaries of the Digital World by Rama Dev Jager and Rafael Ortiz....",
    "date": "SEPTEMBER 29TH, 2021",
    "duration": "01:21:35"
  },
  {
    "title": "#207 Claude Hopkins (Scientific Advertising)",
    "description": "What I learned from reading Scientific Advertising by Claude Hopkins....",
    "date": "SEPTEMBER 26TH, 2021",
    "duration": "50:58"
  },
  {
    "title": "#206 Albert D. Lasker (the creation of the advertising industry)",
    "description": "What I learned from reading The Man Who Sold America: The Amazing (but True!) Story of Albert D. Lasker and the Creation of the Advertising Century by Jeffrey L. Cruikshank and Arthur W. Schultz.",
    "date": "SEPTEMBER 23RD, 2021",
    "duration": "01:36:58"
  },
  {
    "title": "#205 James Dyson (Invention: A Life)",
    "description": "What I learned from reading Invention: A Life by James Dyson....",
    "date": "SEPTEMBER 18TH, 2021",
    "duration": "01:52:12"
  },
  {
    "title": "#204 Steve Jobs (Inside Steve's Brain)",
    "description": "What I learned from reading Inside Steve's Brian by Leander Kahney.",
    "date": "SEPTEMBER 14TH, 2021",
    "duration": "58:50"
  },
  {
    "title": "#203 Georges Doriot (Birth of Venture Capital)",
    "description": "What I learned from reading Creative Capital: Georges Doriot and the Birth of Venture Capital by Spencer Ante....",
    "date": "SEPTEMBER 8TH, 2021",
    "duration": "01:27:06"
  },
  {
    "title": "#202 A Few Lessons From Warren Buffett",
    "description": "What I learned from reading A Few Lessons for Investors and Managers From Warren Buffett by Warren Buffett and Peter Bevelin.",
    "date": "SEPTEMBER 2ND, 2021",
    "duration": "01:07:00"
  },
  {
    "title": "#201 Isambard Kingdom Brunel (James Dyson's Hero)",
    "description": "What I learned from reading Isambard Kingdom Brunel: The Definitive Biography of The Engineer, Visionary, and Great Briton by L.T.C. Rolt.",
    "date": "AUGUST 30TH, 2021",
    "duration": "01:13:32"
  },
  {
    "title": "#200 James Dyson (Against the Odds)",
    "description": "What I learned from rereading Against The Odds: An Autobiography by James Dyson and reading A History of Great Inventions by James Dyson....",
    "date": "AUGUST 27TH, 2021",
    "duration": "02:14:09"
  },
  {
    "title": "#199 Coco Chanel: The Legend and the Life",
    "description": "What I learned from reading Coco Chanel: The Legend and the Life by Justine Picardie.",
    "date": "AUGUST 20TH, 2021",
    "duration": "01:03:44"
  },
  {
    "title": "#198 Nathan Rothschild (Rothschild Family Dynasty)",
    "description": "What I learned from reading The House of Rothschild: Money's Prophets by Niall Ferguson.",
    "date": "AUGUST 18TH, 2021",
    "duration": "01:15:04"
  },
  {
    "title": "#197 Founder of the Rothschild Family Dynasty",
    "description": "What I learned from reading Founder: A Portrait of the First Rothschild by Amos Elon....",
    "date": "AUGUST 11TH, 2021",
    "duration": "01:17:22"
  },
  {
    "title": "#196 Winston Churchill (Leadership during WW2)",
    "description": "What I learned from reading The Splendid and the Vile: A Saga of Churchill, Family, and Defiance During the Blitz by Erik Larson....",
    "date": "AUGUST 7TH, 2021",
    "duration": "01:19:18"
  },
  {
    "title": "#195 Sid Meier (Computer game designer)",
    "description": "What I learned from reading Sid Meier's Memoir!: A Life in Computer Games by Sid Meier....",
    "date": "JULY 31ST, 2021",
    "duration": "01:13:50"
  },
  {
    "title": "#194 Ernest Hemingway (Writer, Sailor, Soldier, Spy)",
    "description": "What I learned from reading Writer, Sailor, Soldier, Spy: Ernest Hemingway's Secret Adventures, 1935-1961 by Nicholas Reynolds....",
    "date": "JULY 27TH, 2021",
    "duration": "01:17:34"
  },
  {
    "title": "#193 Arnold Schwarzenegger (Arnold's first autobiography)",
    "description": "What I learned from reading Arnold: The Education of a Bodybuilder by Arnold Schwarzenegger.",
    "date": "JULY 22ND, 2021",
    "duration": "58:46"
  },
  {
    "title": "#192 Jim Casey (Founder of UPS)",
    "description": "What I learned from reading Big Brown: The Untold Story of UPS by Greg Niemann....",
    "date": "JULY 19TH, 2021",
    "duration": "01:07:40"
  },
  {
    "title": "#191 Naval Ravikant (A Guide to Wealth and Happiness)",
    "description": "What I learned from reading The Almanack of Naval Ravikant: A Guide to Wealth and Happiness by Naval Ravikant and Eric Jorgenson....",
    "date": "JULY 13TH, 2021",
    "duration": "01:05:37"
  },
  {
    "title": "#190 Henry Ford and Thomas Edison",
    "description": "What I learned from reading The Vagabonds: The Story of Henry Ford and Thomas Edison's Ten-Year Road Trip by Jeff Guinn....",
    "date": "JULY 10TH, 2021",
    "duration": "59:56"
  },
  {
    "title": "#189 David Ogilvy (The book I've given as a gift the most)",
    "description": "What I learned from reading The Unpublished David Ogilvy by David Ogilvy....",
    "date": "JULY 5TH, 2021",
    "duration": "59:12"
  },
  {
    "title": "#188 Joe Coulombe (Founder of Trader Joes)",
    "description": "What I learned from Becoming Trader Joe: How I Did Business My Way and Still Beat the Big Guys by Joe Coulombe.",
    "date": "JUNE 28TH, 2021",
    "duration": "01:15:28"
  },
  {
    "title": "#187 Albert Einstein",
    "description": "What I learned from reading Einstein: His Life and Universe by Walter Isaacson....",
    "date": "JUNE 22ND, 2021",
    "duration": "01:25:14"
  },
  {
    "title": "#186 Phil Knight (Nike)",
    "description": "What I learned from rereading Shoe Dog: A Memoir by the Creator of Nike by Phil Knight.",
    "date": "JUNE 16TH, 2021",
    "duration": "01:42:53"
  },
  {
    "title": "#185 César Ritz and Auguste Escoffier (The Hotelier and The Chef)",
    "description": "What I learned from reading Ritz and Escoffier: The Hotelier, The Chef, and the Rise of the Leisure Class by Luke Barr....",
    "date": "JUNE 11TH, 2021",
    "duration": "01:22:12"
  },
  {
    "title": "#184 Isadore Sharp (Four Seasons)",
    "description": "What I learned from reading Four Seasons: The Story of a Business Philosophy by Isadore Sharp.",
    "date": "JUNE 7TH, 2021",
    "duration": "01:16:46"
  },
  {
    "title": "#183 Johnny Carson",
    "description": "What I learned from reading Johnny Carson by Henry Bushkin....",
    "date": "JUNE 4TH, 2021",
    "duration": "01:17:54"
  },
  {
    "title": "#182 Warren Buffett (The Making of an American Capitalist)",
    "description": "What I learned from reading Buffett: The Making of an American Capitalist by Roger Lowenstein.",
    "date": "MAY 29TH, 2021",
    "duration": "01:12:58"
  },
  {
    "title": "#181 Paul Orfalea (Kinkos)",
    "description": "What I learned from reading Copy This!: How I turned Dyslexia, ADHD, and 100 square feet into a company called Kinkos by Paul Orfalea.",
    "date": "MAY 23RD, 2021",
    "duration": "01:13:23"
  },
  {
    "title": "#180 Jeff Bezos (Invention of a Global Empire)",
    "description": "What I learned from reading Amazon Unbound: Jeff Bezos and the Invention of a Global Empire by Brad Stone.",
    "date": "MAY 17TH, 2021",
    "duration": "01:03:47"
  },
  {
    "title": "Jeff Bezos (Insights, Stories, and Secrets)",
    "description": "What I learned from Working Backwards: Insights, Stories, and Secrets from Inside Amazon by Colin Bryar and Bill Carr.",
    "date": "MAY 13TH, 2021",
    "duration": "01:03:28"
  },
  {
    "title": "#179 Jeff Bezos",
    "description": "What I learned from The Everything Store: Jeff Bezos and the Age of Amazon by Brad Stone....",
    "date": "MAY 10TH, 2021",
    "duration": "01:21:12"
  },
  {
    "title": "#178 Jony Ive: The Genius Behind Apple's Greatest Products",
    "description": "What I learned from reading Jony Ive: The Genius Behind Apple's Greatest Products by Leander Kahney.",
    "date": "MAY 3RD, 2021",
    "duration": "01:21:33"
  },
  {
    "title": "#177 Robert Campeau (Junk Bonds and Retail Bankruptcy)",
    "description": "What I learned from reading Going for Broke: How Robert Campeau Bankrupted the Retail Industry, Jolted the Junk Bond Market, and Brought the Booming Eighties to a Crashing Halt by John Rothchild.",
    "date": "APRIL 26TH, 2021",
    "duration": "01:09:16"
  },
  {
    "title": "#176 Linus Torvalds (Creator of Linux)",
    "description": "What I learned from reading Just for Fun: The Story of an Accidental Revolutionary by Linus Torvalds and David Diamond.",
    "date": "APRIL 18TH, 2021",
    "duration": "52:56"
  },
  {
    "title": "#175 Theodore Roosevelt's Darkest Journey",
    "description": "What I learned from reading The River of Doubt: Theodore Roosevelt's Darkest Journey by Candice Millard....",
    "date": "APRIL 11TH, 2021",
    "duration": "01:19:48"
  },
  {
    "title": "#174 Bill Gates (Overdrive)",
    "description": "What I learned from reading Overdrive: Bill Gates and the Race to Control Cyberspace by James Wallace.",
    "date": "APRIL 5TH, 2021",
    "duration": "48:15"
  },
  {
    "title": "#173 Louis B. Mayer (MGM Studios)",
    "description": "What I learned from reading Hollywood Rajah: The Life and Times of Louis B. Mayer by Bosley Crowther....",
    "date": "MARCH 28TH, 2021",
    "duration": "01:09:22"
  },
  {
    "title": "#172 Elon Musk (Early Days of SpaceX)",
    "description": "What I learned from reading Liftoff: Elon Musk and the Desperate Early Days That Launched SpaceX by Eric Berger....",
    "date": "MARCH 21ST, 2021",
    "duration": "01:05:57"
  },
  {
    "title": "#171: Chuck Feeney (The Billionaire who gave all of his money away)",
    "description": "What I learned from reading The Billionaire Who Wasn't: How Chuck Feeney Secretly Made and Gave Away a Fortune by Conor O'Clery.",
    "date": "MARCH 15TH, 2021",
    "duration": "01:09:07"
  },
  {
    "title": "#170 Claude Hopkins (A Life in Advertising)",
    "description": "What I learned from reading My Life in Advertising by Claude Hopkins....",
    "date": "MARCH 8TH, 2021",
    "duration": "01:19:06"
  },
  {
    "title": "#169 David Ogilvy (The King of Madison Avenue)",
    "description": "What I learned from reading The King of Madison Avenue: David Ogilvy and the Making of Modern Advertising by Kenneth Roman....",
    "date": "MARCH 1ST, 2021",
    "duration": "01:28:07"
  },
  {
    "title": "#168 Larry Miller (Driven: An Autobiography)",
    "description": "What I learned from reading Driven: An Autobiography by Larry Miller....",
    "date": "FEBRUARY 22ND, 2021",
    "duration": "01:08:00"
  },
  {
    "title": "#167 Jackie Cochran (Aviation)",
    "description": "What I learned from reading Jackie Cochran: An Autobiography by Jackie Cochran....",
    "date": "FEBRUARY 19TH, 2021",
    "duration": "56:45"
  },
  {
    "title": "#166 Robert Noyce (Intel)",
    "description": "What I learned from reading The Man Behind the Microchip: Robert Noyce and the Invention of Silicon Valley by Leslie Berlin.",
    "date": "FEBRUARY 8TH, 2021",
    "duration": "01:12:55"
  },
  {
    "title": "#165 William Shockley (Creator of the Electronic Age)",
    "description": "What I learned from reading Broken Genius: The Rise and Fall of William Shockley, Creator of the Electronic Age by Joel Shurkin....",
    "date": "FEBRUARY 1ST, 2021",
    "duration": "01:02:09"
  },
  {
    "title": "#164 Robert Goddard (Rocket Man)",
    "description": "What I learned from reading Rocket Man: Robert Goddard and the Birth of the Space Age by David A. Clary....",
    "date": "JANUARY 25TH, 2021",
    "duration": "01:05:28"
  },
  {
    "title": "#163 Alfred Nobel",
    "description": "What I learned from reading Alfred Nobel: A Biography by Kenne Fant.",
    "date": "JANUARY 18TH, 2021",
    "duration": "01:01:47"
  },
  {
    "title": "#162 Chuck Yeager",
    "description": "What I learned from reading Yeager: An Autobiography by General Chuck Yeager....",
    "date": "JANUARY 11TH, 2021",
    "duration": "01:19:30"
  },
  {
    "title": "#161 Dr. Seuss",
    "description": "What I learned from reading Becoming Dr. Seuss: Theodor Geisel and the Making of an American Imagination by Brian Jay Jones....",
    "date": "JANUARY 4TH, 2021",
    "duration": "01:06:51"
  },
  {
    "title": "#160 Peter Cundill",
    "description": "What I learned from reading Routines and Orgies: The Life of Peter Cundill, Financial Genius, Philosopher, and Philanthropist by Christopher Risso-Gill.",
    "date": "DECEMBER 28TH, 2020",
    "duration": "01:09:49"
  },
  {
    "title": "#159 Andy Grove (Intel)",
    "description": "What I learned from reading Swimming Across by Andrew S. Grove....",
    "date": "DECEMBER 21ST, 2020",
    "duration": "01:10:19"
  },
  {
    "title": "#158 Walt Disney (Disneyland)",
    "description": "What I learned from reading Disney’s Land: Walt Disney and the Invention of the Amusement Park That Changed the World by Richard Snow.",
    "date": "DECEMBER 14TH, 2020",
    "duration": "51:57"
  },
  {
    "title": "#157 The Innovators: How a Group of Hackers, Geniuses, and Geeks Created the Digital Revolution",
    "description": "What I learned from reading The Innovators: How a Group of Hackers, Geniuses, and Geeks Created the Digital Revolution by Walter Isaacson.",
    "date": "DECEMBER 7TH, 2020",
    "duration": "58:27"
  },
  {
    "title": "#156 Theodore Roosevelt",
    "description": "What I learned from reading Mornings on Horseback: The Story of an Extraordinary Family, a Vanished Way of Life and the Unique Child Who Became Theodore Roosevelt.",
    "date": "NOVEMBER 30TH, 2020",
    "duration": "56:50"
  },
  {
    "title": "#155 Jeff Bezos (Shareholder Letters and Speeches)",
    "description": "What I learned from reading Invent and Wander: The Collected Writings of Jeff Bezos, With an Introduction by Walter Isaacson.",
    "date": "NOVEMBER 23RD, 2020",
    "duration": "01:08:01"
  },
  {
    "title": "#154 Charles Schulz (Charlie Brown)",
    "description": "What I learned from reading My Life with Charlie Brown by Charles Schulz....",
    "date": "NOVEMBER 19TH, 2020",
    "duration": "52:53"
  },
  {
    "title": "#153 Bill Bowerman (Nike)",
    "description": "What I learned from reading Bowerman and the Men of Oregon: The Story of Oregon's Legendary Coach and Nike's Cofounder by Kenny Moore....",
    "date": "NOVEMBER 12TH, 2020",
    "duration": "01:18:00"
  },
  {
    "title": "#152 Katherine Graham (Washington Post)",
    "description": "What I learned from reading Personal History by Katherine Graham....",
    "date": "NOVEMBER 5TH, 2020",
    "duration": "01:03:16"
  },
  {
    "title": "#151 Frederick Smith (FedEx)",
    "description": "What I learned from reading Overnight Success: Federal Express and Frederick Smith, Its Renegade Creator by Vance Trimble....",
    "date": "OCTOBER 29TH, 2020",
    "duration": "01:07:36"
  },
  {
    "title": "#150 Sam Walton (America's Richest Man)",
    "description": "What I learned from reading Sam Walton: The Inside Story of America's Richest Man by Vance H. Trimble.",
    "date": "OCTOBER 24TH, 2020",
    "duration": "54:27"
  },
  {
    "title": "#149 The Big Rich (Oil Billionaires)",
    "description": "What I learned from reading The Big Rich: The Rise and Fall of the Greatest Texas Oil Fortunes by Bryan Burrough.",
    "date": "OCTOBER 18TH, 2020",
    "duration": "01:10:59"
  },
  {
    "title": "#148 John D. Rockefeller (Autobiography)",
    "description": "What I learned from Random Reminiscences of Men and Events by John D. Rockefeller....",
    "date": "OCTOBER 11TH, 2020",
    "duration": "57:10"
  },
  {
    "title": "#147 Sam Colt",
    "description": "What I learned from reading Revolver: Sam Colt and the Six-Shooter That Changed America by Jim Rasenberger.",
    "date": "OCTOBER 5TH, 2020",
    "duration": "01:08:58"
  },
  {
    "title": "#146 Milton Hershey (Chocolate)",
    "description": "What I learned from reading Hershey: Milton S. Hershey's Extraordinary Life of Wealth, Empire, and Utopian Dreams by Michael D'Antonio.",
    "date": "SEPTEMBER 27TH, 2020",
    "duration": "49:12"
  },
  {
    "title": "#145 William Randolph Hearst",
    "description": "What I learned from reading The Chief: The Life of William Randolph Hearst by David Nasaw.",
    "date": "SEPTEMBER 20TH, 2020",
    "duration": "01:05:36"
  },
  {
    "title": "#144 Ernest Shackleton",
    "description": "What I learned from reading Endurance: Shackleton's Incredible Voyage by Alfred Lansing.",
    "date": "SEPTEMBER 13TH, 2020",
    "duration": "55:13"
  },
  {
    "title": "#143 Alfred Lee Loomis (the most interesting man you've never heard of)",
    "description": "What I learned from reading Tuxedo Park : A Wall Street Tycoon and the Secret Palace of Science That Changed the Course of World War II by James Conant.",
    "date": "SEPTEMBER 6TH, 2020",
    "duration": "56:09"
  },
  {
    "title": "#142 Teddy Roosevelt and J.P. Morgan",
    "description": "What I learned from reading The Hour of Fate: Theodore Roosevelt, J.P. Morgan, and the Battle to Transform American Capitalism by Susan Berfield....",
    "date": "AUGUST 31ST, 2020",
    "duration": "51:23"
  },
  {
    "title": "#141 Arnold Schwarzenegger (My Unbelievably True Life Story)",
    "description": "What I learned from reading Total Recall: My Unbelievably True Life Story by Arnold Schwarzenegger",
    "date": "AUGUST 23RD, 2020",
    "duration": "01:03:15"
  },
  {
    "title": "#140 Bill Gates (the Making of the Microsoft Empire)",
    "description": "What I learned from reading Hard Drive: Bill Gates and the Making of the Microsoft Empire by James Wallace and Jim Erickson....",
    "date": "AUGUST 16TH, 2020",
    "duration": "55:00"
  },
  {
    "title": "#139 J.P. Morgan",
    "description": "What I learned from reading The House of Morgan: An American Banking Dynasty and the Rise of Modern Finance by Ron Chernow....",
    "date": "AUGUST 9TH, 2020",
    "duration": "01:08:15"
  },
  {
    "title": "#138 Alexander Graham Bell",
    "description": "What I learned from reading Reluctant Genius: The Passionate Life and Inventive Mind of Alexander Graham Bell.",
    "date": "AUGUST 2ND, 2020",
    "duration": "01:00:55"
  },
  {
    "title": "#137 P.T. Barnum",
    "description": "What I learned from reading Barnum: An American Life by Robert Wilson....",
    "date": "JULY 26TH, 2020",
    "duration": "01:02:36"
  },
  {
    "title": "#136 Estée Lauder",
    "description": "What I learned from reading A Success Story by Estee Lauder.",
    "date": "JULY 19TH, 2020",
    "duration": "44:31"
  },
  {
    "title": "#135 Joseph Pulitzer (Politics & Media)",
    "description": "What I learned from reading Pulitzer: A Life in Politics, Print, and Power by James McGrath Morris.",
    "date": "JULY 12TH, 2020",
    "duration": "01:07:14"
  },
  {
    "title": "#134 Edwin Land (Polaroid vs Kodak)",
    "description": "What I learned from reading A Triumph of Genius: Edwin Land, Polaroid, and the Kodak Patent War by Ronald Fierstein....",
    "date": "JULY 1ST, 2020",
    "duration": "01:18:07"
  },
  {
    "title": "#133 Edwin Land (Polaroid and The Man Who Invented It)",
    "description": "What I learned from reading Land’s Polaroid: A Company and The Man Who Invented It by Peter C. Wensberg.",
    "date": "JUNE 25TH, 2020",
    "duration": "54:34"
  },
  {
    "title": "#132 Edwin Land (Steve Jobs's Hero)",
    "description": "What I learned from reading The Instant Image: Edwin Land and the Polaroid Experience by Mark Olshaker....",
    "date": "JUNE 20TH, 2020",
    "duration": "01:01:38"
  },
  {
    "title": "#131 Robert Friedland (Billionaire Miner)",
    "description": "What I learned from reading The Big Score: Robert Friedland and The Voisey’s Bay Hustle by Jacquie McNish.",
    "date": "JUNE 15TH, 2020",
    "duration": "01:03:31"
  },
  {
    "title": "#130 Walter Chrysler",
    "description": "What I learned from reading Life of an American Workman by Walter Chrysler.",
    "date": "JUNE 9TH, 2020",
    "duration": "01:08:09"
  },
  {
    "title": "#129 Felix Dennis (How to Get Rich)",
    "description": "What I learned from reading How to Get Rich: One of the World's Greatest Entrepreneurs Shares His Secrets by Felix Dennis....",
    "date": "JUNE 4TH, 2020",
    "duration": "59:11"
  },
  {
    "title": "#128 Henry Leland (Cadillac)",
    "description": "What I learned from reading Master of Precision: Henry Leland by Ottilie Leland and Minnie Dubbs Millbrook.",
    "date": "JUNE 1ST, 2020",
    "duration": "01:09:55"
  },
  {
    "title": "#127 Larry Ellison (Oracle)",
    "description": "What I learned from reading The Difference Between God and Larry Ellison: God Doesn't Think He's Larry Ellison by Mike Wilson.",
    "date": "MAY 26TH, 2020",
    "duration": "59:14"
  },
  {
    "title": "#126: Larry Ellison (The Billionaire and the Mechanic)",
    "description": "What I learned from reading The Billionaire and the Mechanic: How Larry Ellison and a Car Mechanic Teamed up to Win Sailing's Greatest Race, the America’s Cup, Twice by Julian Guthrie.",
    "date": "MAY 21ST, 2020",
    "duration": "01:08:57"
  },
  {
    "title": "#125 Charles Kettering (inventor, engineer, founder)",
    "description": "What I learned from reading Professional Amateur: The Biography of Charles Franklin Kettering by Thomas Boyd",
    "date": "MAY 15TH, 2020",
    "duration": "01:11:26"
  },
  {
    "title": "#124 Larry Ellison and Oracle",
    "description": "What I learned from reading Softwar: An Intimate Portrait of Larry Ellison and Oracle by Matthew Symonds.",
    "date": "MAY 9TH, 2020",
    "duration": "01:11:42"
  },
  {
    "title": "#123 Albert Champion (Record-Setting Racer to Dashing Tycoon)",
    "description": "What I learned from reading The Fast Times of Albert Champion: From Record-Setting Racer to Dashing Tycoon, An Untold Story of Speed, Success, and Betrayal by Peter Joffre Nye.",
    "date": "MAY 2ND, 2020",
    "duration": "01:04:32"
  },
  {
    "title": "#122 Alfred Sloan (General Motors)",
    "description": "What I learned from reading My Years with General Motors by Alfred Sloan.",
    "date": "APRIL 27TH, 2020",
    "duration": "01:05:15"
  },
  {
    "title": "#121 Billy Durant and Alfred Sloan (General Motors)",
    "description": "What I learned from reading Billy, Alfred, and General Motors: The Story of Two Unique Men, A Legendary Company, and a Remarkable Time in American History by William Pelfrey.",
    "date": "APRIL 20TH, 2020",
    "duration": "01:22:09"
  },
  {
    "title": "#120 Billy Durant (Creator of General Motors)",
    "description": "What I learned from reading Billy Durant Creator of General Motors: The Story of the Flamboyant Genius Who Helped Lead America into the Automobile Age by Lawrence Gustin.",
    "date": "APRIL 12TH, 2020",
    "duration": "01:11:13"
  },
  {
    "title": "#119 The Dodge Brothers",
    "description": "What I learned from reading The Dodge Brothers: The Men, the Motor Cars, and the Legacy by Charles Hyde.",
    "date": "APRIL 6TH, 2020",
    "duration": "53:31"
  },
  {
    "title": "#118 Forty Years With Henry Ford",
    "description": "What I learned by reading My Forty Years With Ford by Charles Sorensen.",
    "date": "APRIL 1ST, 2020",
    "duration": "01:20:18"
  },
  {
    "title": "#117 : Chung Ju-yung founder of Hyundai (the most inspiring autobiography I've read)",
    "description": "What I learned from reading Born of This Land: My Life Story by Chung Ju-yung.",
    "date": "MARCH 26TH, 2020",
    "duration": "01:20:26"
  },
  {
    "title": "#116 Sam Bronfman (Seagram's and the Bronfman family dynasty)",
    "description": "What I learned from reading Sam Bronfman: The Life and Times of Seagram's Mr. Sam by by Michael R. Marrus.",
    "date": "MARCH 21ST, 2020",
    "duration": "01:07:19"
  },
  {
    "title": "#115 Ben Franklin: An American Life",
    "description": "What I learned from reading Benjamin Franklin: An American Life by Walter Isaacson.",
    "date": "MARCH 16TH, 2020",
    "duration": "45:38"
  },
  {
    "title": "#114 The Professor, the Banker, and the Suicide King: Inside the Richest Poker Game of All Time",
    "description": "What I learned from reading The Professor, the Banker, and the Suicide King: Inside the Richest Poker Game of All Time by Michael Craig....",
    "date": "MARCH 9TH, 2020",
    "duration": "01:20:12"
  },
  {
    "title": "#113 A.G. Gaston (Black Titan and the Making of a Black American Millionaire)",
    "description": "What I learned from reading Black Titan: A.G. Gaston and the Making of a Black American Millionaire by Carol Jenkins and Elizabeth Gardner Hines.",
    "date": "MARCH 5TH, 2020",
    "duration": "01:08:23"
  },
  {
    "title": "#112 Frank Lloyd Wright",
    "description": "What I learned from reading Plagued by Fire: The Dreams and Furies of Frank Lloyd Wright by Paul Hendrickson....",
    "date": "FEBRUARY 24TH, 2020",
    "duration": "01:20:45"
  },
  {
    "title": "#111 David Geffen",
    "description": "What I learned from reading The Operator: David Geffen Builds, Buys, and Sells the New Hollywood by Tom King....",
    "date": "FEBRUARY 16TH, 2020",
    "duration": "01:22:53"
  },
  {
    "title": "#110 Henry Singleton (Teledyne)",
    "description": "What I learned from reading Distant Force: A Memoir of the Teledyne Corporation and the Man Who Created It by Dr. George Roberts....",
    "date": "FEBRUARY 10TH, 2020",
    "duration": "01:25:47"
  },
  {
    "title": "#109 Adi Dassler (Adidas)",
    "description": "What I learned from reading Sneaker Wars: The Enemy Brothers Who Founded Adidas and Puma and The Family Feud That Forever Changed The Business of Sports by Barbara Smit.",
    "date": "FEBRUARY 3RD, 2020",
    "duration": "01:13:26"
  },
  {
    "title": "#108 Jim Simons (Money Printer)",
    "description": "What I learned from reading The Man Who Solved The Market: How Jim Simons Launched The Quant Revolution by Gregory Zuckerman...",
    "date": "JANUARY 26TH, 2020",
    "duration": "01:07:25"
  },
  {
    "title": "#107 Sol Price (Costco)",
    "description": "What I learned from reading Sol Price: Retail Revolutionary & Social Innovator by Robert E. Price.",
    "date": "JANUARY 20TH, 2020",
    "duration": "01:08:32"
  },
  {
    "title": "#106 Bill Walsh (The Score Takes Care of Itself)",
    "description": "What I learned from reading The Score Takes Care of Itself: My Philosophy of Leadership by Bill Walsh....",
    "date": "JANUARY 12TH, 2020",
    "duration": "01:06:12"
  },
  {
    "title": "#105 Les Schwab (Charlie Munger recommended this book)",
    "description": "What I learned from reading Les Schwab Pride In Performance: Keep It Going! by Les Schwab....",
    "date": "JANUARY 5TH, 2020",
    "duration": "01:19:19"
  },
  {
    "title": "#104 Ingvar Kamprad (IKEA)",
    "description": "What I learned from reading Leading By Design: The Ikea Story by Ingvar Kamprad and Bertil Torekull.",
    "date": "DECEMBER 30TH, 2019",
    "duration": "01:22:20"
  },
  {
    "title": "#103 Hetty Green (The Richest Woman in America)",
    "description": "What I learned from reading The Richest Woman in America: Hetty Green in the Gilded Age by Janet Wallach....",
    "date": "DECEMBER 22ND, 2019",
    "duration": "01:01:46"
  },
  {
    "title": "#102 Akio Morita (Sony)",
    "description": "What I learned from reading Made in Japan: Akio Morita and Sony by Akio Morita....",
    "date": "DECEMBER 15TH, 2019",
    "duration": "01:16:17"
  },
  {
    "title": "#101 Warren Buffett (The Tao of Warren Buffett)",
    "description": "What I learned from reading The Tao of Warren Buffett by David Clark and Mary Buffett....",
    "date": "DECEMBER 8TH, 2019",
    "duration": "42:15"
  },
  {
    "title": "#100 Warren Buffett (The Snowball)",
    "description": "What I learned from reading The Snowball: Warren Buffett and the Business of Life by Alice Schroeder.",
    "date": "DECEMBER 1ST, 2019",
    "duration": "01:26:14"
  },
  {
    "title": "#99 Carroll Shelby (My name is Carroll Shelby and performance is my business)",
    "description": "What I learned from reading Carroll Shelby: The Authorized Biography by Rinsey Mills....",
    "date": "NOVEMBER 24TH, 2019",
    "duration": "01:18:02"
  },
  {
    "title": "#98 Enzo Ferrari (the making of an automobile empire)",
    "description": "What I learned from reading Enzo Ferrari: Power, Politics, and the Making of an Automobile Empire by Luca Dal Monte.",
    "date": "NOVEMBER 18TH, 2019",
    "duration": "01:02:57"
  },
  {
    "title": "#97 Enzo Ferrari (Ferrari vs Ford)",
    "description": "What I learned from reading Go Like Hell: Ford, Ferrari, and Their Battle for Speed and Glory at Le Mans by A. J. Baime.",
    "date": "NOVEMBER 10TH, 2019",
    "duration": "54:59"
  },
  {
    "title": "#96 James J. Hill (Empire Builder of the Northwest)",
    "description": "What I learned from reading James J. Hill: Empire Builder of the Northwest by Michael P. Malone.",
    "date": "NOVEMBER 4TH, 2019",
    "duration": "58:56"
  },
  {
    "title": "#95 Claude Shannon",
    "description": "What I learned from reading A Mind at Play: How Claude Shannon Invented the Information Age by Jimmy Soni and Rob Goodman...",
    "date": "OCTOBER 27TH, 2019",
    "duration": "01:05:22"
  },
  {
    "title": "#94 Henry Singleton (The Outsiders)",
    "description": "What I learned from reading The Outsiders: Eight Unconventional CEOs and Their Radically Rational Blueprint for Success by William Thorndike.",
    "date": "OCTOBER 21ST, 2019",
    "duration": "01:20:55"
  },
  {
    "title": "#93 Ed Thorp (A Man for All Markets)",
    "description": "What I learned from reading A Man for All Markets: From Las Vegas to Wall Street, How I Beat the Dealer and the Market by Edward Thorp....",
    "date": "OCTOBER 13TH, 2019",
    "duration": "01:07:49"
  },
  {
    "title": "#92 Ed Thorp and Claude Shannon",
    "description": "What I learned from reading Fortune's Formula: The Untold Story of the Scientific Betting System That Beat the Casinos and Wall Street by William Poundstone.",
    "date": "OCTOBER 7TH, 2019",
    "duration": "01:22:12"
  },
  {
    "title": "#91 Jim Clayton (Sold to Warren Buffett)",
    "description": "What I learned from reading First A Dream by Jim Clayton.",
    "date": "SEPTEMBER 29TH, 2019",
    "duration": "01:01:17"
  },
  {
    "title": "#90 Charlie Munger (Poor Charlie's Almanack)",
    "description": "What I learned from reading Poor Charlie's Almanack: The Wit and Wisdom of Charles T. Munger.",
    "date": "SEPTEMBER 22ND, 2019",
    "duration": "01:37:15"
  },
  {
    "title": "#89 David Ogilvy (Confessions of an Advertising Man)",
    "description": "What I learned by reading Confessions of an Advertising Man by David Ogilvy.",
    "date": "SEPTEMBER 15TH, 2019",
    "duration": "01:20:47"
  },
  {
    "title": "#88 Warren Buffett's Shareholder Letters— All of them!",
    "description": "What I learned from reading Berkshire Hathaway Letters to Shareholders by Warren Buffett.",
    "date": "SEPTEMBER 9TH, 2019",
    "duration": "03:01:11"
  },
  {
    "title": "#87 Thomas Watson (IBM)",
    "description": "What I learned from reading The Maverick and His Machine: Thomas Watson Sr. and The Making of IBM by Kevin Maney.",
    "date": "SEPTEMBER 1ST, 2019",
    "duration": "01:12:03"
  },
  {
    "title": "#86 Carl Bosch and Fritz Haber (A Genius and a Doomed Tycoon)",
    "description": "What I learned from reading The Alchemy of Air: A Jewish Genius, a Doomed Tycoon, and the Scientific Discovery That Fed the World but Fueled the Rise of Hitler by Thomas Hager.",
    "date": "AUGUST 25TH, 2019",
    "duration": "01:21:05"
  },
  {
    "title": "#85 Walter and Olive Ann Beech (Aviation Legends)",
    "description": "What I learned from reading The Barnstormer and The Lady: Aviation Legends Walter and Olive Ann Beech by Dennis Farney...",
    "date": "AUGUST 18TH, 2019",
    "duration": "01:09:29"
  },
  {
    "title": "#84 Aristotle Onassis",
    "description": "What I learned from reading Onassis: The Definitive Biography by Willi Frischauer",
    "date": "AUGUST 11TH, 2019",
    "duration": "01:28:02"
  },
  {
    "title": "#83 Thomas Edison, Nikola Tesla, George Westinghouse, and the Race to Electrify the World",
    "description": "What I learned from reading Empires of Light: Edison, Tesla, Westinghouse, and the Race to Electrify the World by Jill Jonnes.",
    "date": "AUGUST 4TH, 2019",
    "duration": "01:50:20"
  },
  {
    "title": "#82 David Ogilvy (Ogilvy on Advertising)",
    "description": "What I learned from reading Ogilvy on Advertising by David Ogilvy.",
    "date": "JULY 28TH, 2019",
    "duration": "01:03:38"
  },
  {
    "title": "#81 Henry Royce (Founder of Rolls-Royce)",
    "description": "What I learned from reading Rolls-Royce: The First Forty Years of Britain's Most Prestigious Company by Peter Pugh....",
    "date": "JULY 22ND, 2019",
    "duration": "01:11:39"
  },
  {
    "title": "#80 Henry Ford (Today and Tomorrow)",
    "description": "What I learned from reading Today and Tomorrow by Henry Ford....",
    "date": "JULY 14TH, 2019",
    "duration": "45:44"
  },
  {
    "title": "#79 Charlie Munger (The Complete Investor)",
    "description": "What I learned from reading Charlie Munger: The Complete Investor by Tren Griffin.",
    "date": "JULY 7TH, 2019",
    "duration": "01:12:59"
  },
  {
    "title": "#78 Charlie Munger (the Tao of Charlie Munger)",
    "description": "What I learned from reading Tao of Charlie Munger: A Compilation of Quotes from Berkshire Hathaway's Vice Chairman on Life, Business, and the Pursuit of Wealth With Commentary by David Clark",
    "date": "JUNE 30TH, 2019",
    "duration": "58:57"
  },
  {
    "title": "#77 Steve Jobs (The NeXT Years)",
    "description": "What I learned from reading Steve Jobs & The NeXT Big Thing by Randall Stross.",
    "date": "JUNE 23RD, 2019",
    "duration": "01:37:32"
  },
  {
    "title": "#76 Steve Jobs: The Early Years of Apple",
    "description": "What I learned from reading Return to the Little Kingdom: Steve Jobs and the Creation of Apple by Michael Moritz.",
    "date": "JUNE 16TH, 2019",
    "duration": "01:13:10"
  },
  {
    "title": "#75 Henry Clay Frick: Andrew Carnegie's Partner",
    "description": "What I learned from reading Henry Clay Frick: The Life of the Perfect Capitalist by Quentin Skrabec Jr.",
    "date": "JUNE 9TH, 2019",
    "duration": "01:22:34"
  },
  {
    "title": "#74 The Autobiography of Andrew Carnegie",
    "description": "What I learned from reading The Autobiography of Andrew Carnegie by Andrew Carnegie",
    "date": "JUNE 2ND, 2019",
    "duration": "55:04"
  },
  {
    "title": "#73 Andrew Carnegie and Henry Clay Frick: The Bitter Partnership That Changed America",
    "description": "What I learned from reading Meet You in Hell: Andrew Carnegie, Henry Clay Frick, and the Bitter Partnership That Changed America by Les Standiford....",
    "date": "MAY 26TH, 2019",
    "duration": "01:32:16"
  },
  {
    "title": "#72 Stan Lee: Founder of Marvel",
    "description": "What I learned from reading Excelsior! The Amazing Life of Stan Lee by Stan Lee and George Mair....",
    "date": "MAY 19TH, 2019",
    "duration": "59:13"
  },
  {
    "title": "#71 Jeff Bezos' Shareholder Letters",
    "description": "\"To read Bezos’ shareholder letters is to get a crash course in running a high-growth internet business from someone who mastered it before any of the playbooks were written.\"",
    "date": "MAY 12TH, 2019",
    "duration": "01:47:44"
  },
  {
    "title": "#70 Mark Spitznagel: The Dao of Capital",
    "description": "What I learned from reading The Dao of Capital: Austrian Investing in a Distorted World by Mark Spitznagel.",
    "date": "MAY 6TH, 2019",
    "duration": "59:16"
  },
  {
    "title": "#69 Charles Goodyear: An Inventor's Obsession and the Struggle for a Rubber Monopoly",
    "description": "What I learned from reading The Goodyear Story: An Inventor's Obsession and The Struggle For A Rubber Monopoly by Richard Korman.",
    "date": "APRIL 28TH, 2019",
    "duration": "01:12:39"
  },
  {
    "title": "#68 Daniel Ludwig: The Invisible Billionaire",
    "description": "What I learned from reading The Invisible Billionaire: Daniel Ludwig by Jerry Shields.",
    "date": "APRIL 21ST, 2019",
    "duration": "01:26:33"
  },
  {
    "title": "#67 Conrad Hilton: Hilton Hotel Dynasty",
    "description": "What I learned from reading The Hiltons: The True Story of an American Dynasty by J. Randy Taraborrelli.",
    "date": "APRIL 14TH, 2019",
    "duration": "01:25:35"
  },
  {
    "title": "#66 Henry Kaiser: Builder in the Modern American West",
    "description": "What I learned from reading Henry J. Kaiser: Builder in the Modern American West by Mark Foster....",
    "date": "APRIL 7TH, 2019",
    "duration": "01:24:39"
  },
  {
    "title": "#65 Kirk Kerkorian: Penniless Dropout became the Greatest Deal Maker in Capitalist History",
    "description": "What I learned from reading The Gambler: How Penniless Dropout Kirk Kerkorian Became the Greatest Deal Maker in Capitalist History by William C. Rempel.",
    "date": "MARCH 31ST, 2019",
    "duration": "01:10:04"
  },
  {
    "title": "#64 Coco Chanel: Her Life and Secrets",
    "description": "What I learned from reading Coco Chanel: Her Life, Her Secrets.",
    "date": "MARCH 24TH, 2019",
    "duration": "58:09"
  },
  {
    "title": "#63 The King of Oil: The Secret Lives of Marc Rich",
    "description": "What I learned by from reading The King of Oil: The Secret Lives of Marc Rich by Daniel Ammann.",
    "date": "MARCH 10TH, 2019",
    "duration": "01:24:12"
  },
  {
    "title": "#62 The Autobiography of Benjamin Franklin",
    "description": "What I learned from reading The Autobiography of Benjamin Franklin by Benjamin Franklin....",
    "date": "MARCH 4TH, 2019",
    "duration": "01:07:24"
  },
  {
    "title": "#61 Malcom McLean: The Box: How the Shipping Container Made the World Smaller and the World Economy Bigger",
    "description": "What I learned from reading The Box: How the Shipping Container Made the World Smaller and the World Economy Bigger.",
    "date": "FEBRUARY 25TH, 2019",
    "duration": "01:29:40"
  },
  {
    "title": "#60 Yvon Chouinard: What We've Learned from Patagonia's First 40 Years",
    "description": "What I learned from reading The Responsible Company: What We've Learned From Patagonia's First 40 Years by Yvon Chouinard and Vincent Stanley.",
    "date": "FEBRUARY 18TH, 2019",
    "duration": "01:11:48"
  },
  {
    "title": "#59 Howard Hughes: The Definitive Biography of the First American Billionaire",
    "description": "What I learned from reading Hughes: The Private Diaries, Memos and Letters; The Definitive Biography of the First American Billionaire.",
    "date": "FEBRUARY 11TH, 2019",
    "duration": "01:51:26"
  },
  {
    "title": "#58 John Bogle: Enough: True Measures of Money, Business, and Life",
    "description": "What I learned from reading Enough: True Measures of Money, Business, and Life by John Bogle.",
    "date": "FEBRUARY 4TH, 2019",
    "duration": "57:59"
  },
  {
    "title": "#57 John Bogle: Stay the Course: The Story of Vanguard and the Index Revolution",
    "description": "What I learned from reading Stay the Course: The Story of Vanguard and the Index Revolution.",
    "date": "JANUARY 28TH, 2019",
    "duration": "01:29:35"
  },
  {
    "title": "#56 The Biography of Herb Kelleher",
    "description": "What I learned from reading Nuts!: Southwest Airlines' Crazy Recipe for Business and Personal Success",
    "date": "JANUARY 22ND, 2019",
    "duration": "01:09:41"
  },
  {
    "title": "#55 Tycoon's War: How Cornelius Vanderbilt Invaded a Country to Overthrow America's Most Famous Military Adventurer",
    "description": "What I learned from reading Tycoon's War: How Cornelius Vanderbilt Invaded a Country to Overthrow America's Most Famous Military Adventurer by Stephen Dando-Collins",
    "date": "JANUARY 14TH, 2019",
    "duration": "01:23:00"
  },
  {
    "title": "#54 The Epic Life of Cornelius Vanderbilt",
    "description": "What I learned by reading The First Tycoon: The Epic Life of Cornelius Vanderbilt by TJ Stiles....",
    "date": "JANUARY 8TH, 2019",
    "duration": "01:29:55"
  },
  {
    "title": "#53 Who Is Michael Ovitz?",
    "description": "What I learned from reading Who Is Michael Ovitz? by Michael Ovitz....",
    "date": "JANUARY 1ST, 2019",
    "duration": "01:46:52"
  },
  {
    "title": "#52 The Republic of Tea: The Story of the Creation of a Business, as Told Through the Personal Letters of Its Founders",
    "description": "What I learned from reading The Republic of Tea: The Story of the Creation of a Business, as Told Through the Personal Letters of Its Founders.",
    "date": "DECEMBER 25TH, 2018",
    "duration": "01:31:10"
  },
  {
    "title": "#51 Wild Company: The Untold Story of Banana Republic",
    "description": "What I learned from reading Wild Company: The Untold Story of Banana Republic by Mel and Patricia Ziegler",
    "date": "DECEMBER 17TH, 2018",
    "duration": "01:27:20"
  },
  {
    "title": "#50 Marc Andreessen's Blog Archive",
    "description": "What I learned from reading The Pmarca Blog Archive Ebook by Marc Andreessen.",
    "date": "DECEMBER 11TH, 2018",
    "duration": "01:04:44"
  },
  {
    "title": "#49 Screw It, Let's Do It: Lessons in Life by Richard Branson",
    "description": "What I learned from reading Screw It, Let's Do It: Lessons in Life by Richard Branson.",
    "date": "DECEMBER 3RD, 2018",
    "duration": "40:33"
  },
  {
    "title": "#48 Finding My Virginity: The New Autobiography by Richard Branson",
    "description": "What I learned from reading Finding My Virginity: The New Autobiography by Richard Branson.",
    "date": "NOVEMBER 26TH, 2018",
    "duration": "01:16:06"
  },
  {
    "title": "#47 Losing My Virginity: How I Survived, Had Fun, and Made a Fortune Doing Business My Way",
    "description": "What I learned from reading Losing My Virginity: How I Survived, Had Fun, and Made a Fortune Doing Business My Wayby Richard Branson",
    "date": "NOVEMBER 19TH, 2018",
    "duration": "01:12:52"
  },
  {
    "title": "#46 I Love Capitalism: An American Story",
    "description": "What I learned from reading I Love Capitalism: An American Story by Ken Langone....",
    "date": "NOVEMBER 13TH, 2018",
    "duration": "01:11:04"
  },
  {
    "title": "#45 Built From Scratch: How A Couple of Regular Guys Grew The Home Depot from Nothing to $30 Billion",
    "description": "What I learned from reading Built From Scratch: How A Couple of Regular Guys Grew The Home Depot from Nothing to $30 Billion by Bernie Marcus and Arthur Blank....",
    "date": "NOVEMBER 5TH, 2018",
    "duration": "01:20:23"
  },
  {
    "title": "#44 A Memoir by the Cofounder of Microsoft",
    "description": "What I learned from reading Idea Man: A Memoir by the Cofounder of Microsoft by Paul Allen...",
    "date": "OCTOBER 30TH, 2018",
    "duration": "01:22:37"
  },
  {
    "title": "#43 Ray Dalio: Principles: Life and Work",
    "description": "What I learned from reading Principles: Life and Work by Ray Dalio.",
    "date": "OCTOBER 22ND, 2018",
    "duration": "01:02:33"
  },
  {
    "title": "#42 One From Many: VISA and the Rise of Chaordic Organization",
    "description": "What I learned from reading One From Many: VISA and the Rise of Chaordic Organization by Dee Hock...",
    "date": "OCTOBER 16TH, 2018",
    "duration": "01:27:24"
  },
  {
    "title": "#41 The Hard Thing About Hard Things: Building a Business When There Are No Easy Answers",
    "description": "What I learned from reading The Hard Thing About Hard Things: Building a Business When There Are No Easy Answers by Ben Horowitz.",
    "date": "OCTOBER 8TH, 2018",
    "duration": "59:30"
  },
  {
    "title": "#40 Insisting On The Impossible: The Life of Edwin Land and Instant: The Story of Polaroid",
    "description": "What I learned from reading Insisting On The Impossible: The Life of Edwin Land and Instant: The Story of Polaroid.",
    "date": "OCTOBER 2ND, 2018",
    "duration": "01:09:15"
  },
  {
    "title": "#39 Walt Disney: An American Original",
    "description": "What I learned from reading Walt Disney: An American Original by Bob Thomas.",
    "date": "SEPTEMBER 24TH, 2018",
    "duration": "01:35:42"
  },
  {
    "title": "#38 The Space Barons: Elon Musk, Jeff Bezos, and the Quest to Colonize the Cosmos",
    "description": "What I learned from reading The Space Barons: Elon Musk, Jeff Bezos, and the Quest to Colonize the Cosmos by Christian Davenport....",
    "date": "SEPTEMBER 17TH, 2018",
    "duration": "01:30:09"
  },
  {
    "title": "#37 The Fish That Ate The Whale: The Life and Times of America's Banana King",
    "description": "What I learned from reading The Fish That Ate the Whale: The Life and Times of America's Banana King by Rich Cohen.",
    "date": "SEPTEMBER 9TH, 2018",
    "duration": "01:21:05"
  },
  {
    "title": "#36 Finding The Next Steve Jobs: How to Find, Keep, and Nurture Talent",
    "description": "What I learned from reading Finding The Next Steve Jobs: How to Find, Keep, and Nurture Talent by Nolan Bushnell....",
    "date": "SEPTEMBER 3RD, 2018",
    "duration": "44:40"
  },
  {
    "title": "#35 George Lucas: A Life",
    "description": "What I learned from reading George Lucas: A Life by Brian Jay Jones....",
    "date": "AUGUST 26TH, 2018",
    "duration": "01:21:38"
  },
  {
    "title": "#34 Creativity Inc: The Autobiography of the founder of Pixar",
    "description": "What I learned from reading Creativity Inc: Overcoming The Unseen Forces That Stand In The Way of True Inspiration by Ed Catmull....",
    "date": "AUGUST 20TH, 2018",
    "duration": "01:27:30"
  },
  {
    "title": "#33 Levi Strauss: The Man Who Gave Blue Jeans to the World",
    "description": "What I learned from reading Levi Strauss: The Man Who Gave Blue Jeans to the World by Lynn Downey",
    "date": "AUGUST 12TH, 2018",
    "duration": "01:19:35"
  },
  {
    "title": "#32 Alibaba: The House That Jack Ma Built",
    "description": "What I learned from reading Alibaba: The House That Jack Ma Built by Duncan Clark....",
    "date": "AUGUST 9TH, 2018",
    "duration": "01:48:08"
  },
  {
    "title": "#31 Conspiracy: Peter Thiel, Hulk Hogan, Gawker, and the Anatomy of Intrigue and Zero to One: Notes on Startups, or How to Build the Future",
    "description": "What I learned from reading Conspiracy: Peter Thiel, Hulk Hogan, Gawker, and the Anatomy of Intrigue and Zero to One: Notes on Startups, or How to Build the Future.",
    "date": "AUGUST 2ND, 2018",
    "duration": "02:38:22"
  },
  {
    "title": "#30 Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future",
    "description": "What I learned from reading Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future by Ashlee Vance....",
    "date": "JULY 9TH, 2018",
    "duration": "38:26"
  },
  {
    "title": "#29 The HP Way: How Bill Hewlett and I Built Our Company",
    "description": "What I learned from reading The HP Way: How Bill Hewlett and I Built Our Company by David Packard.",
    "date": "JULY 2ND, 2018",
    "duration": "39:05"
  },
  {
    "title": "#28 The Wright Brothers",
    "description": "What I learned from reading The Wright Brothers by David McCullough",
    "date": "JUNE 25TH, 2018",
    "duration": "41:40"
  },
  {
    "title": "#27 A Truck Full of Money: Coding, Mania, Love, Genius: The Life of an American Entrepreneur",
    "description": "What I learned from reading A Truck Full of Money: Coding, Mania, Love, Genius: The Life of an American Entrepreneurby Tracy Kidder",
    "date": "JUNE 15TH, 2018",
    "duration": "01:24:53"
  },
  {
    "title": "#26 My Life and Work: The Autobiography of Henry Ford",
    "description": "What I learned from My Life and Work: The Autobiography of Henry Ford.",
    "date": "MAY 2ND, 2018",
    "duration": "52:42"
  },
  {
    "title": "#25 Against the Odds: An Autobiography by James Dyson",
    "description": "What I learned from reading Against the Odds: An Autobiography by James Dyson",
    "date": "APRIL 22ND, 2018",
    "duration": "01:25:44"
  },
  {
    "title": "#24 No Better Time: The Brief, Remarkable Life of Danny Lewin, the Genius Who Transformed the Internet",
    "description": "What I learnd by reading No Better Time: The Brief, Remarkable Life of Danny Lewin, the Genius Who Transformed the Internet by Molly Knight Raskin.",
    "date": "APRIL 15TH, 2018",
    "duration": "01:15:12"
  },
  {
    "title": "#23 The New New Thing: A Silicon Valley Story",
    "description": "What I learned from reading The New New Thing: A Silicon Valley Story by Michael Lewis.",
    "date": "APRIL 7TH, 2018",
    "duration": "01:01:55"
  },
  {
    "title": "#22 How To Turn Down A Billion Dollars: The Snapchat Story",
    "description": "What I learned from reading How to Turn Down a Billion Dollars: The Snapchat Story by Billy Gallagher....",
    "date": "MARCH 20TH, 2018",
    "duration": "01:03:09"
  },
  {
    "title": "#21 Masters of Doom: How Two Guys Created an Empire and Transformed Pop Culture",
    "description": "What I learned from reading Masters of Doom: How Two Guys Created an Empire and Transformed Pop Culture by David Kushner....",
    "date": "MARCH 1ST, 2018",
    "duration": "01:28:52"
  },
  {
    "title": "#20 Danny Meyer (The Transforming Power of Hospitality in Business)",
    "description": "What I learned from reading Setting the Table: The Transforming Power of Hospitality in Business by Danny Meyer....",
    "date": "FEBRUARY 6TH, 2018",
    "duration": "43:05"
  },
  {
    "title": "#19 Becoming Steve Jobs",
    "description": "What I learned from reading Becoming Steve Jobs: The Evolution of a Reckless Upstart into a Visionary Leader by Brent Schlender and Rick Tetzeli.",
    "date": "JANUARY 19TH, 2018",
    "duration": "01:13:53"
  },
  {
    "title": "#18 Let My People Go Surfing: The Education of a Reluctant Businessman",
    "description": "What I learned from reading Let My People Go Surfing: The Education of a Reluctant Businessman by Yvon Chouinard.",
    "date": "JANUARY 8TH, 2018",
    "duration": "56:35"
  },
  {
    "title": "#17 Jeff Bezos and the Age of Amazon",
    "description": "What I learned from reading The Everything Store: Jeff Bezos and the Age of Amazon by Brad Stone....",
    "date": "JANUARY 1ST, 2018",
    "duration": "01:03:55"
  },
  {
    "title": "#16 Titan: The Life of John D. Rockefeller",
    "description": "What I learned from reading Titan: The Life of John D. Rockefeller by Ron Chernow",
    "date": "DECEMBER 8TH, 2017",
    "duration": "01:03:32"
  },
  {
    "title": "#15 Leonardo da Vinci: The Biography",
    "description": "What I learned from reading Leonardo da Vinci by Walter Isaacson....",
    "date": "NOVEMBER 17TH, 2017",
    "duration": "46:55"
  },
  {
    "title": "#14 The Accidental Billionaires: The Founding of Facebook: A Tale of Sex, Money, Genius, and Betrayal",
    "description": "What I learned from reading The Accidental Billionaires: The Founding of Facebook: A Tale of Sex, Money, Genius, and Betrayal by Ben Mezrich.",
    "date": "SEPTEMBER 17TH, 2017",
    "duration": "38:20"
  },
  {
    "title": "#13 Elon Musk and Why SpaceX Will Colonize Mars",
    "description": "What I learned from reading The Elon Musk Blog Series: Wait But Why by Tim Urban.",
    "date": "AUGUST 27TH, 2017",
    "duration": "55:10"
  },
  {
    "title": "#12 Elon Musk & How Tesla Will Change The World",
    "description": "What I learned by reading How Tesla Will Change The World by Tim Urban",
    "date": "AUGUST 20TH, 2017",
    "duration": "41:23"
  },
  {
    "title": "#11 The Cook & The Chef: Elon Musk's Secret Sauce",
    "description": "What I learned from reading The Elon Musk Blog Series: Wait But Why by Tim Urban",
    "date": "AUGUST 13TH, 2017",
    "duration": "45:02"
  },
  {
    "title": "#10 Shoe Dog: A Memoir by the Creator of Nike",
    "description": "What I learned from reading Shoe Dog: A Memoir by the Creator of Nike by Phil Knight.",
    "date": "JULY 27TH, 2017",
    "duration": "01:04:34"
  },
  {
    "title": "#9 I Invented the Modern Age: The Rise of Henry Ford",
    "description": "What I learned from reading I Invented the Modern Age: The Rise of Henry Ford by Richard Snow.",
    "date": "JULY 10TH, 2017",
    "duration": "01:10:46"
  },
  {
    "title": "#8 The Intel Trinity: How Robert Noyce, Gordon Moore, and Andy Grove Built the World's Most Important Company",
    "description": "What I learned from reading The Intel Trinity: How Robert Noyce, Gordon Moore, and Andy Grove Built the World's Most Important Company by Michael Malone.",
    "date": "JUNE 20TH, 2017",
    "duration": "01:00:53"
  },
  {
    "title": "#7 Grinding It Out: The Making of McDonald's",
    "description": "What I learned from reading Grinding It Out: The Making of McDonald's by Ray Kroc.",
    "date": "MAY 27TH, 2017",
    "duration": "01:03:14"
  },
  {
    "title": "#6 Sam Walton",
    "description": "What I learned from reading Sam Walton: Made In America by Sam Walton.",
    "date": "MAY 14TH, 2017",
    "duration": "01:04:16"
  },
  {
    "title": "#5 Steve Jobs",
    "description": "What I learned from reading Steve Jobs by Walter Isaacson.",
    "date": "APRIL 30TH, 2017",
    "duration": "01:35:31"
  },
  {
    "title": "#4 The Remarkable Life and Turbulent Times of Joseph P. Kennedy",
    "description": "What I learned from reading The Patriarch: The Remarkable Life and Turbulent Times of Joseph P. Kennedy by David Nasaw",
    "date": "APRIL 19TH, 2017",
    "duration": "57:03"
  },
  {
    "title": "#3 The Wizard of Menlo Park: How Thomas Edison Invented The Modern the Modern World",
    "description": "What I learned from reading The Wizard of Menlo Park: How Thomas Alva Edison Invented The Modern World by Randall Stross",
    "date": "MARCH 24TH, 2017",
    "duration": "01:26:52"
  },
  {
    "title": "#2 Walt Disney",
    "description": "What I learned from reading Walt Disney based on the book Walt Disney: The Triumph of the American Imagination by Neal Gabler.",
    "date": "OCTOBER 10TH, 2016",
    "duration": "01:17:51"
  },
  {
    "title": "#1 Elon Musk: Tesla, SpaceX, & the Quest for a Fantastic Future",
    "description": "What I learned from reading Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future by Ashlee Vance",
    "date": "SEPTEMBER 19TH, 2016",
    "duration": "58:13"
  }
]